{
  "books" : [
      {
        "id": 236,
        "title": "A Storm of Swords",
        "description": "The Seven Kingdoms are torn by strife as the three surviving contenders for the throne continue their struggle for power, Robb Stark defends his fledgling kingdom from the ravaging Greyjoys, Winterfell lies in ruins, Jon Snow confronts an escalating threat from behind the Wall, and Danerys Stormborn and her dragon allies continue to grow in power. Here is the third volume in George R. Martin's magnificent cycle of novels that includes A Game of Thrones and A Clash of Kings. As a whole, this series comprises a genuine masterpiece of modern fantasy, bringing together the best the genre has to offer. Magic, mystery, intrigue, romance, and adventure fill these pages and transport us to a world unlike any we have ever experienced. Already hailed as a classic, George R. Martin's stunning series is destined to stand as one of the great achievements of imaginative fiction. A Storm of Swords Of the five contenders for power, one is dead, another in disfavor, and still the wars rage as violently as ever, as alliances are made and broken. Joffrey, of House Lannister, sits on the Iron Throne, the uneasy ruler of the land of the Seven Kingdoms. His most bitter rival, Lord Stannis, stands defeated and disgraced, the victim of the jealous sorceress who holds him in her evil thrall. But young Robb, of House Stark, still rules the North from the fortress of Riverrun. Robb plots against his despised Lannister enemies, even as they hold his sister hostage at King's Landing, the seat of the Iron Throne. Meanwhile, making her way across a blood-drenched continent is the exiled queen, Daenerys, mistress of the only three dragons still left in the world. But as opposing forces maneuver for the final titanic showdown, an army of barbaric wildlings arrives from the outermost line of civilization. In their vanguard is a horde of mythical Others--a supernatural army of the living dead whose animated corpses are unstoppable. As the future of the land hangs in the balance, no one will rest until the Seven Kingdoms have exploded in a veritable storm of swords.",
        "contributions": [
          {
            "author": {
              "name": "George R.R. Martin"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/book_mappings/7332349/5249dbcbc118ae4ea68c37295c8386f96c341c95.jpeg"
        },
        "rating": 4.5234375,
        "ratings_count": 1472,
        "ratings_distribution": [
          {
            "count": 5,
            "rating": 1
          },
          {
            "count": 9,
            "rating": 2
          },
          {
            "count": 1,
            "rating": 2.5
          },
          {
            "count": 103,
            "rating": 3
          },
          {
            "count": 6,
            "rating": 3.5
          },
          {
            "count": 425,
            "rating": 4
          },
          {
            "count": 24,
            "rating": 4.5
          },
          {
            "count": 899,
            "rating": 5
          }
        ],
        "reviews_count": 72,
        "release_year": 2000
      },
      {
        "id": 644,
        "title": "A Game of Thrones",
        "description": "Summers span decades. Winter can last a lifetime. And the struggle for the Iron Throne has begun. As Warden of the north, Lord Eddard Stark counts it a curse when King Robert bestows on him the office of the Hand. His honour weighs him down at court where a true man does what he will, not what he must ...and a dead enemy is a thing of beauty. The old gods have no power in the south, Stark's family is split and there is treachery at court. Worse, the vengeance-mad heir of the deposed Dragon King has grown to maturity in exile in the Free Cities. He claims the Iron Throne.",
        "contributions": [
          {
            "author": {
              "name": "George R.R. Martin"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/914414/6726176539138138.jpg"
        },
        "rating": 4.368645640074211,
        "ratings_count": 2695,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 30,
            "rating": 1
          },
          {
            "count": 4,
            "rating": 1.5
          },
          {
            "count": 48,
            "rating": 2
          },
          {
            "count": 8,
            "rating": 2.5
          },
          {
            "count": 236,
            "rating": 3
          },
          {
            "count": 26,
            "rating": 3.5
          },
          {
            "count": 850,
            "rating": 4
          },
          {
            "count": 76,
            "rating": 4.5
          },
          {
            "count": 1416,
            "rating": 5
          }
        ],
        "reviews_count": 127,
        "release_year": 1996
      },
      {
        "id": 657,
        "title": "American Gods",
        "description": "Released from prison, Shadow finds his world turned upside down. His wife has been killed; a stranger offers him a job and Shadow, with nothing to lose, accepts. But a storm is coming. Beneath the placid surface of everyday life, a war is being fought – and the prize is the very soul of America.\n\nAn inspired combination of mythology, adventure, and illusion, American Gods is a dark and kaleidoscopic journey deep into myth and across an America at once eerily familiar and utterly alien. It is, quite simply, a contemporary masterpiece.",
        "contributions": [
          {
            "author": {
              "name": "Neil Gaiman"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/external_data/30222505/3e02a50c5ecf68835504b66795c7553ae9cc6d98.jpeg"
        },
        "rating": 4.01875,
        "ratings_count": 1760,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 26,
            "rating": 1
          },
          {
            "count": 1,
            "rating": 1.5
          },
          {
            "count": 90,
            "rating": 2
          },
          {
            "count": 5,
            "rating": 2.5
          },
          {
            "count": 306,
            "rating": 3
          },
          {
            "count": 20,
            "rating": 3.5
          },
          {
            "count": 677,
            "rating": 4
          },
          {
            "count": 27,
            "rating": 4.5
          },
          {
            "count": 607,
            "rating": 5
          }
        ],
        "reviews_count": 150,
        "release_year": 2001
      },
      {
        "id": 946,
        "title": "The Girl with the Dragon Tattoo",
        "description": "The disappearance forty years ago of Harriet Vanger, a young scion of one of the wealthiest families in Sweden, gnaws at her octogenarian uncle, Henrik Vanger. He is determined to know the truth about what he believes was her murder. He hires crusading journalist Mikael Blomkvist, recently at the wrong end of a libel case, to get to the bottom of Harriet's disappearance. Lisbeth Salander, a twenty-four-year-old, pierced, tattooed genius hacker, possessed of the hard-earned wisdom of someone twice her age--and a terrifying capacity for ruthlessness--assists Blomkvist with the investigation. This unlikely team discovers a vein of nearly unfathomable iniquity running through the Vanger family, an astonishing corruption at the highest echelon of Swedish industrialism--and a surprising connection between themselves.--From publisher description.",
        "contributions": [
          {
            "author": {
              "name": "Stieg Larsson"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/books/379085/9274740-L.jpg"
        },
        "rating": 4.053619302949062,
        "ratings_count": 1492,
        "ratings_distribution": [
          {
            "count": 25,
            "rating": 1
          },
          {
            "count": 67,
            "rating": 2
          },
          {
            "count": 1,
            "rating": 2.5
          },
          {
            "count": 232,
            "rating": 3
          },
          {
            "count": 7,
            "rating": 3.5
          },
          {
            "count": 625,
            "rating": 4
          },
          {
            "count": 18,
            "rating": 4.5
          },
          {
            "count": 517,
            "rating": 5
          }
        ],
        "reviews_count": 125,
        "release_year": 2005
      },
      {
        "id": 26363,
        "title": "Ready Player One",
        "description": "In the year 2045, reality is an ugly place. The only time Wade Watts really feels alive is when he’s jacked into the OASIS, a vast virtual world where most of humanity spends their days.\n\nWhen the eccentric creator of the OASIS dies, he leaves behind a series of fiendish puzzles, based on his obsession with the pop culture of decades past. Whoever is first to solve them will inherit his vast fortune—and control of the OASIS itself. \n\nThen Wade cracks the first clue. Suddenly he’s beset by rivals who’ll kill to take this prize. The race is on—and the only way to survive is to win.\n",
        "contributions": [
          {
            "author": {
              "name": "Ernest Cline"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/external_data/60193667/e18b39394792e119f99b0a51aa170aa3c61de368.jpeg"
        },
        "rating": 3.972860538827258,
        "ratings_count": 2524,
        "ratings_distribution": [
          {
            "count": 4,
            "rating": 0.5
          },
          {
            "count": 92,
            "rating": 1
          },
          {
            "count": 9,
            "rating": 1.5
          },
          {
            "count": 155,
            "rating": 2
          },
          {
            "count": 15,
            "rating": 2.5
          },
          {
            "count": 369,
            "rating": 3
          },
          {
            "count": 45,
            "rating": 3.5
          },
          {
            "count": 844,
            "rating": 4
          },
          {
            "count": 46,
            "rating": 4.5
          },
          {
            "count": 945,
            "rating": 5
          }
        ],
        "reviews_count": 294,
        "release_year": 2008
      },
      {
        "id": 28722,
        "title": "Frankenstein",
        "description": "Frankenstein; or, The Modern Prometheus is an 1818 Gothic novel written by English author Mary Shelley. Frankenstein tells the story of Victor Frankenstein, a young scientist who creates a sapient creature in an unorthodox scientific experiment that involved putting it together with different body parts. Shelley started writing the story when she was 18 and staying in Bath, and the first edition was published anonymously in London on 1 January 1818, when she was 20. Her name first appeared in the second edition, which was published in Paris in 1821.",
        "contributions": [
          {
            "author": {
              "name": "Mary Shelley"
            }
          },
          {
            "author": {
              "name": "Percy Bysshe Shelley"
            }
          },
          {
            "author": {
              "name": "Maurice Hindle"
            }
          },
          {
            "author": {
              "name": "John William Polidori"
            }
          },
          {
            "author": {
              "name": "Lord Byron"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/18780509/e353c2cafc8293db69a5771436ffc8a8779c26ab.jpeg"
        },
        "rating": 3.852199413489736,
        "ratings_count": 1705,
        "ratings_distribution": [
          {
            "count": 23,
            "rating": 1
          },
          {
            "count": 1,
            "rating": 1.5
          },
          {
            "count": 107,
            "rating": 2
          },
          {
            "count": 8,
            "rating": 2.5
          },
          {
            "count": 415,
            "rating": 3
          },
          {
            "count": 39,
            "rating": 3.5
          },
          {
            "count": 606,
            "rating": 4
          },
          {
            "count": 52,
            "rating": 4.5
          },
          {
            "count": 454,
            "rating": 5
          }
        ],
        "reviews_count": 153,
        "release_year": 1818
      },
      {
        "id": 36087,
        "title": "The Road",
        "description": "A father and his son walk alone through burned America. Nothing moves in the ravaged landscape save the ash on the wind. It is cold enough to crack stones, and when the snow falls it is gray. The sky is dark. Their destination is the coast, although they don’t know what, if anything, awaits them there. They have nothing; just a pistol to defend themselves against the lawless bands that stalk the road, the clothes they are wearing, a cart of scavenged food—and each other.",
        "contributions": [
          {
            "author": {
              "name": "Cormac McCarthy"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/642392/7620614454245640-cormacmcarthytheroad.jpg"
        },
        "rating": 4.019736842105263,
        "ratings_count": 1292,
        "ratings_distribution": [
          {
            "count": 17,
            "rating": 1
          },
          {
            "count": 3,
            "rating": 1.5
          },
          {
            "count": 69,
            "rating": 2
          },
          {
            "count": 4,
            "rating": 2.5
          },
          {
            "count": 227,
            "rating": 3
          },
          {
            "count": 19,
            "rating": 3.5
          },
          {
            "count": 470,
            "rating": 4
          },
          {
            "count": 37,
            "rating": 4.5
          },
          {
            "count": 446,
            "rating": 5
          }
        ],
        "reviews_count": 125,
        "release_year": 1974
      },
      {
        "id": 57214,
        "title": "Dark Matter",
        "description": "A mindbending, relentlessly surprising thriller from the author of the bestselling Wayward Pines trilogy. “Are you happy with your life?” Those are the last words Jason Dessen hears before the masked abductor knocks him unconscious. Before he awakens to find himself strapped to a gurney, surrounded by strangers in hazmat suits. Before a man Jason’s never met smiles down at him and says, “Welcome back, my friend.” In this world he’s woken up to, Jason’s life is not the one he knows. His wife is not his wife. His son was never born. And Jason is not an ordinary college physics professor, but a celebrated genius who has achieved something remarkable. Something impossible. Is it this world or the other that’s the dream? And even if the home he remembers is real, how can Jason possibly make it back to the family he loves? The answers lie in a journey more wondrous and horrifying than anything he could’ve imagined—one that will force him to confront the darkest parts of himself even as he battles a terrifying, seemingly unbeatable foe. Dark Matter is a brilliantly plotted tale that is at once sweeping and intimate, mind-bendingly strange and profoundly human—a relentlessly surprising science-fiction thriller about choices, paths not taken, and how far we’ll go to claim the lives we dream of.",
        "contributions": [
          {
            "author": {
              "name": "Blake Crouch"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/book_mappings/7332342/e3c5928fc0a24ca97940c68f03dd2b503e42ba4f.jpeg"
        },
        "rating": 4.033602150537634,
        "ratings_count": 1488,
        "ratings_distribution": [
          {
            "count": 12,
            "rating": 1
          },
          {
            "count": 3,
            "rating": 1.5
          },
          {
            "count": 61,
            "rating": 2
          },
          {
            "count": 8,
            "rating": 2.5
          },
          {
            "count": 258,
            "rating": 3
          },
          {
            "count": 33,
            "rating": 3.5
          },
          {
            "count": 591,
            "rating": 4
          },
          {
            "count": 40,
            "rating": 4.5
          },
          {
            "count": 482,
            "rating": 5
          }
        ],
        "reviews_count": 220,
        "release_year": 2016
      },
      {
        "id": 77104,
        "title": "The Eye of the World",
        "description": "In the Third Age, an age of prophecy when the world and time themselves hang in the balance, the Dark One, imprisoned by the Creator, is stirring in Shayol Ghul.",
        "contributions": [
          {
            "author": {
              "name": "Robert Jordan"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/book_mappings/7332323/437a620631d0c64a358d4a53c9c19addb3440e26.jpeg"
        },
        "rating": 4.018253968253968,
        "ratings_count": 1260,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 16,
            "rating": 1
          },
          {
            "count": 1,
            "rating": 1.5
          },
          {
            "count": 62,
            "rating": 2
          },
          {
            "count": 6,
            "rating": 2.5
          },
          {
            "count": 210,
            "rating": 3
          },
          {
            "count": 18,
            "rating": 3.5
          },
          {
            "count": 500,
            "rating": 4
          },
          {
            "count": 34,
            "rating": 4.5
          },
          {
            "count": 412,
            "rating": 5
          }
        ],
        "reviews_count": 134,
        "release_year": 1990
      },
      {
        "id": 80378,
        "title": "The Song of Achilles",
        "description": "A thrilling, profoundly moving, and utterly unique retelling of the legend of Achilles and the Trojan War from the bestselling author of Circe\n\nA tale of gods, kings, immortal fame, and the human heart, The Song of Achilles is a dazzling literary feat that brilliantly reimagines Homer’s enduring masterwork, The Iliad. An action-packed adventure, an epic love story, a marvelously conceived and executed page-turner, Miller’s monumental debut novel has already earned resounding acclaim from some of contemporary fiction’s brightest lights—and fans of Mary Renault, Bernard Cornwell, Steven Pressfield, and Colleen McCullough’s Masters of Rome series will delight in this unforgettable journey back to ancient Greece in the Age of Heroes.\n\n“A captivating retelling of The Iliad and events leading up to it through the point of view of Patroclus: it’s a hard book to put down, and any classicist will be enthralled by her characterisation of the goddess Thetis, which carries the true savagery and chill of antiquity.” — Donna Tartt, The Times",
        "contributions": [
          {
            "author": {
              "name": "Madeline Miller"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/8933288/8719175186248367.jpg"
        },
        "rating": 4.255542240862792,
        "ratings_count": 1669,
        "ratings_distribution": [
          {
            "count": 3,
            "rating": 0.5
          },
          {
            "count": 12,
            "rating": 1
          },
          {
            "count": 3,
            "rating": 1.5
          },
          {
            "count": 53,
            "rating": 2
          },
          {
            "count": 5,
            "rating": 2.5
          },
          {
            "count": 198,
            "rating": 3
          },
          {
            "count": 41,
            "rating": 3.5
          },
          {
            "count": 508,
            "rating": 4
          },
          {
            "count": 67,
            "rating": 4.5
          },
          {
            "count": 779,
            "rating": 5
          }
        ],
        "reviews_count": 279,
        "release_year": 1995
      },
      {
        "id": 88639,
        "title": "The Hunger Games",
        "description": "In the ruins of a place once known as North America lies the nation of Panem, a shining Capitol surrounded by twelve outlying districts. The Capitol is harsh and cruel and keeps the districts in line by forcing them all to send one boy and one girl between the ages of twelve and eighteen to participate in the annual Hunger Games, a fight to the death on live TV. \n\nSixteen-year-old Katniss Everdeen regards it as a death sentence when she steps forward to take her sister's place in the Games. But Katniss has been close to dead before-and survival, for her, is second nature. Without really meaning to, she becomes a contender. \n\nBut if she is to win, she will have to start making choices that weigh survival against humanity and life against love.",
        "contributions": [
          {
            "author": {
              "name": "Suzanne Collins"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/1589497/2979196565308831-lf%202.jpeg"
        },
        "rating": 4.109086491739553,
        "ratings_count": 4116,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 40,
            "rating": 1
          },
          {
            "count": 2,
            "rating": 1.5
          },
          {
            "count": 161,
            "rating": 2
          },
          {
            "count": 7,
            "rating": 2.5
          },
          {
            "count": 653,
            "rating": 3
          },
          {
            "count": 72,
            "rating": 3.5
          },
          {
            "count": 1531,
            "rating": 4
          },
          {
            "count": 100,
            "rating": 4.5
          },
          {
            "count": 1549,
            "rating": 5
          }
        ],
        "reviews_count": 225,
        "release_year": 2008
      },
      {
        "id": 103241,
        "title": "The Hero of Ages",
        "description": "This book is not only the third book in a trilogy, but it’s Act Three of the the three-act structure for the Mistborn Trilogy—it’s the part of the story where the heroes have discovered that what they thought was the problem all along was not the true danger, and now they’re fighting for not only their own survival but that of the world they live in. The mists are killing people and staying out much longer than they should. The Ashmounts are spewing more and more choking ash into the sky, burying the crops that everyone needs to eat to live. And Ruin, the creature Vin was tricked into freeing from its prison of a millennium, is loose to wreak havoc upon the land. Life under the Lord Ruler is starting to look like paradise in comparison.\r\n\r\nWhile the first book in the trilogy turned the standard fantasy story on its head, this volume (perhaps inevitably?) returns in a way to the tropes the first volume was a reaction against. Yet in this case the enemy is not a human or humanlike Dark Lord, but something more like a force of nature—entropy itself given a will and a guiding personality in the form of Ruin.\r\n\r\nUltimately, the book is about how the characters we have grown to love from the previous volumes—Vin, Elend, Sazed, TenSoon, Spook, Marsh, and others—find the courage and faith to fight on in the face of overwhelming odds, just as Kelsier taught them when he plotted the downfall of the Final Empire.",
        "contributions": [
          {
            "author": {
              "name": "Brandon Sanderson"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/31464805/75e1c503a87dc7b039ca67ed843a25af3e616ae4.jpeg"
        },
        "rating": 4.561046511627907,
        "ratings_count": 1720,
        "ratings_distribution": [
          {
            "count": 3,
            "rating": 1
          },
          {
            "count": 1,
            "rating": 1.5
          },
          {
            "count": 15,
            "rating": 2
          },
          {
            "count": 2,
            "rating": 2.5
          },
          {
            "count": 111,
            "rating": 3
          },
          {
            "count": 10,
            "rating": 3.5
          },
          {
            "count": 410,
            "rating": 4
          },
          {
            "count": 85,
            "rating": 4.5
          },
          {
            "count": 1083,
            "rating": 5
          }
        ],
        "reviews_count": 158,
        "release_year": 2007
      },
      {
        "id": 109344,
        "title": "Divergent",
        "description": "For sixteen-year-old Tris, the world changes in a heartbeat when she is forced to make a terrible choice. Turning her back on her family, Tris ventures out, alone, determined to find out where she truly belongs.\n\nShocked by the brutality of her new life, Tris can trust no one. And yet she is drawn to a boy who seems to both threaten and protect her. The hardest choices may yet lie ahead...",
        "contributions": [
          {
            "author": {
              "name": "Veronica Roth"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/22182301/7276222-L.jpg"
        },
        "rating": 3.693808049535604,
        "ratings_count": 1615,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 67,
            "rating": 1
          },
          {
            "count": 4,
            "rating": 1.5
          },
          {
            "count": 137,
            "rating": 2
          },
          {
            "count": 7,
            "rating": 2.5
          },
          {
            "count": 404,
            "rating": 3
          },
          {
            "count": 12,
            "rating": 3.5
          },
          {
            "count": 563,
            "rating": 4
          },
          {
            "count": 11,
            "rating": 4.5
          },
          {
            "count": 409,
            "rating": 5
          }
        ],
        "reviews_count": 132,
        "release_year": 2011
      },
      {
        "id": 115005,
        "title": "The Little Prince",
        "description": "A pilot crashes in the Sahara Desert and encounters a strange young boy who calls himself the Little Prince. The Little Prince has traveled there from his home on a lonely, distant asteroid with a single rose. The story that follows is a beautiful and at times heartbreaking meditation on human nature.\n\nThe Little Prince is one of the best-selling and most translated books of all time, universally cherished by children and adults alike, and Richard Howard's translation of the beloved classic beautifully reflects Saint-Exupéry's unique and gifted style, bringing the English text as close as possible to the French in language, style, and spirit.",
        "contributions": [
          {
            "author": {
              "name": "Antoine de Saint-Exupéry"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/30426444/4807756302554780-157993.jpg"
        },
        "rating": 4.226683137739346,
        "ratings_count": 1619,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 17,
            "rating": 1
          },
          {
            "count": 72,
            "rating": 2
          },
          {
            "count": 5,
            "rating": 2.5
          },
          {
            "count": 222,
            "rating": 3
          },
          {
            "count": 16,
            "rating": 3.5
          },
          {
            "count": 468,
            "rating": 4
          },
          {
            "count": 30,
            "rating": 4.5
          },
          {
            "count": 788,
            "rating": 5
          }
        ],
        "reviews_count": 110,
        "release_year": 1914
      },
      {
        "id": 122240,
        "title": "Slaughterhouse 5",
        "description": "Kurt Vonnegut’s masterpiece, Slaughterhouse-Five is “a desperate, painfully honest attempt to confront the monstrous crimes of the twentieth century” (Time). Selected by the Modern Library as one of the 100 best novels of all time Slaughterhouse-Five, an American classic, is one of the world’s great antiwar books. Centering on the infamous World War II firebombing of Dresden, the novel is the result of what Kurt Vonnegut described as a twenty-three-year struggle to write a book about what he had witnessed as an American prisoner of war. It combines historical fiction, science fiction, autobiography, and satire in an account of the life of Billy Pilgrim, a barber’s son turned draftee turned optometrist turned alien abductee. As Vonnegut had, Billy experiences the destruction of Dresden as a POW. Unlike Vonnegut, he experiences time travel, or coming “unstuck in time.” An instant bestseller, Slaughterhouse-Five made Kurt Vonnegut a cult hero in American literature, a reputation that only strengthened over time, despite his being banned and censored by some libraries and schools for content and language. But it was precisely those elements of Vonnegut’s writing—the political edginess, the genre-bending inventiveness, the frank violence, the transgressive wit—that have inspired generations of readers not just to look differently at the world around them but to find the confidence to say something about it. Authors as wide-ranging as Norman Mailer, John Irving, Michael Crichton, Tim O’Brien, Margaret Atwood, Elizabeth Strout, David Sedaris, Jennifer Egan, and J. K. Rowling have all found inspiration in Vonnegut’s words. Jonathan Safran Foer has described Vonnegut as “the kind of writer who made people—young people especially—want to write.” George Saunders has declared Vonnegut to be “the great, urgent, passionate American writer of our century, who offers us . . . a model of the kind of compassionate thinking that might yet save us from ourselves.” More than fifty years after its initial publication at the height of the Vietnam War, Vonnegut’s portrayal of political disillusionment, PTSD, and postwar anxiety feels as relevant, darkly humorous, and profoundly affecting as ever, an enduring beacon through our own era’s uncertainties.",
        "contributions": [
          {
            "author": {
              "name": "Kurt Vonnegut"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/external_data/61018169/3ac5372eda7b2907f886965ff4d1109fe55ed3f0.jpeg"
        },
        "rating": 4.086630695443645,
        "ratings_count": 1668,
        "ratings_distribution": [
          {
            "count": 19,
            "rating": 1
          },
          {
            "count": 84,
            "rating": 2
          },
          {
            "count": 1,
            "rating": 2.5
          },
          {
            "count": 274,
            "rating": 3
          },
          {
            "count": 20,
            "rating": 3.5
          },
          {
            "count": 598,
            "rating": 4
          },
          {
            "count": 34,
            "rating": 4.5
          },
          {
            "count": 638,
            "rating": 5
          }
        ],
        "reviews_count": 103,
        "release_year": 1968
      },
      {
        "id": 123621,
        "title": "Angels & Demons",
        "description": "World-renowned Harvard symbologist Robert Langdon is summoned to a Swiss research facility to analyze a cryptic symbol seared into the chest of a murdered physicist. What he discovers is unimaginable: a deadly vendetta against the Catholic Church by a centuries-old underground organization -- the Illuminati. In a desperate race to save the Vatican from a powerful time bomb, Langdon joins forces in Rome with the beautiful and mysterious scientist Vittoria Vetra. Together they embark on a frantic hunt through sealed crypts, dangerous catacombs, and deserted cathedrals, and into the depths of the most secretive vault on earth...the long-forgotten Illuminati lair.\r\n(back cover)",
        "contributions": [
          {
            "author": {
              "name": "Dan Brown"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/28693581/9565539320945004.jpeg"
        },
        "rating": 3.616866708780796,
        "ratings_count": 1583,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 64,
            "rating": 1
          },
          {
            "count": 2,
            "rating": 1.5
          },
          {
            "count": 161,
            "rating": 2
          },
          {
            "count": 6,
            "rating": 2.5
          },
          {
            "count": 426,
            "rating": 3
          },
          {
            "count": 12,
            "rating": 3.5
          },
          {
            "count": 552,
            "rating": 4
          },
          {
            "count": 4,
            "rating": 4.5
          },
          {
            "count": 355,
            "rating": 5
          }
        ],
        "reviews_count": 42,
        "release_year": 2000
      },
      {
        "id": 139773,
        "title": "The Fellowship of the Ring",
        "description": "In ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, the Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth, it remained lost to him. After many ages it fell into the hands of Bilbo Baggins, as told in The Hobbit.\n\nIn a sleepy village in the Shire, young Frodo Baggins finds himself faced with an immense task, as his elderly cousin Bilbo entrusts the Ring to his care. Frodo must leave his home and make a perilous journey across Middle-earth to the Cracks of Doom, there to destroy the Ring and foil the Dark Lord in his evil purpose.",
        "contributions": [
          {
            "author": {
              "name": "J.R.R. Tolkien"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/external_data/60317439/7b1ee0c176bc47adc4fcf2a5b695989577f907c2.jpeg"
        },
        "rating": 4.39229889439573,
        "ratings_count": 2623,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 13,
            "rating": 1
          },
          {
            "count": 1,
            "rating": 1.5
          },
          {
            "count": 67,
            "rating": 2
          },
          {
            "count": 3,
            "rating": 2.5
          },
          {
            "count": 235,
            "rating": 3
          },
          {
            "count": 30,
            "rating": 3.5
          },
          {
            "count": 776,
            "rating": 4
          },
          {
            "count": 69,
            "rating": 4.5
          },
          {
            "count": 1428,
            "rating": 5
          }
        ],
        "reviews_count": 90,
        "release_year": 1954
      },
      {
        "id": 144636,
        "title": "A Dance with Dragons",
        "description": "#1 NEW YORK TIMES BESTSELLER • THE BOOK BEHIND THE FIFTH SEASON OF THE ACCLAIMED HBO SERIES GAME OF THRONES Don’t miss the thrilling sneak peek of George R. R. Martin’s A Song of Ice and Fire: Book Six, The Winds of Winter Dubbed “the American Tolkien” by Time magazine, George R. R. Martin has earned international acclaim for his monumental cycle of epic fantasy. Now the #1 New York Times bestselling author delivers the fifth book in his landmark series—as both familiar faces and surprising new forces vie for a foothold in a fragmented empire. A DANCE WITH DRAGONS In the aftermath of a colossal battle, the future of the Seven Kingdoms hangs in the balance—beset by newly emerging threats from every direction. In the east, Daenerys Targaryen, the last scion of House Targaryen, rules with her three dragons as queen of a city built on dust and death. But Daenerys has thousands of enemies, and many have set out to find her. As they gather, one young man embarks upon his own quest for the queen, with an entirely different goal in mind. Fleeing from Westeros with a price on his head, Tyrion Lannister, too, is making his way to Daenerys. But his newest allies in this quest are not the rag-tag band they seem, and at their heart lies one who could undo Daenerys’s claim to Westeros forever. Meanwhile, to the north lies the mammoth Wall of ice and stone—a structure only as strong as those guarding it. There, Jon Snow, 998th Lord Commander of the Night’s Watch, will face his greatest challenge. For he has powerful foes not only within the Watch but also beyond, in the land of the creatures of ice. From all corners, bitter conflicts reignite, intimate betrayals are perpetrated, and a grand cast of outlaws and priests, soldiers and skinchangers, nobles and slaves, will face seemingly insurmountable obstacles. Some will fail, others will grow in the strength of darkness. But in a time of rising restlessness, the tides of destiny and politics will lead inevitably to the greatest dance of all. Praise for A Dance with Dragons “Filled with vividly rendered set pieces, unexpected turnings, assorted cliffhangers and moments of appalling cruelty, A Dance with Dragons is epic fantasy as it should be written: passionate, compelling, convincingly detailed and thoroughly imagined.”—The Washington Post “Long live George Martin . . . a literary dervish, enthralled by complicated characters and vivid language, and bursting with the wild vision of the very best tale tellers.”—The New York Times",
        "contributions": [
          {
            "author": {
              "name": "George R.R. Martin"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/30557816/098eed15a4689a13b8c22bb57e03376a89e23a43.jpeg"
        },
        "rating": 4.22563025210084,
        "ratings_count": 1190,
        "ratings_distribution": [
          {
            "count": 9,
            "rating": 1
          },
          {
            "count": 23,
            "rating": 2
          },
          {
            "count": 1,
            "rating": 2.5
          },
          {
            "count": 171,
            "rating": 3
          },
          {
            "count": 5,
            "rating": 3.5
          },
          {
            "count": 457,
            "rating": 4
          },
          {
            "count": 15,
            "rating": 4.5
          },
          {
            "count": 509,
            "rating": 5
          }
        ],
        "reviews_count": 69,
        "release_year": 2011
      },
      {
        "id": 149361,
        "title": "To Kill a Mockingbird",
        "description": "The unforgettable novel of a childhood in a sleepy Southern town and the crisis of conscience that rocked it. \"To Kill A Mockingbird\" became both an instant bestseller and a critical success when it was first published in 1960. It went on to win the Pulitzer Prize in 1961 and was later made into an Academy Award-winning film, also a classic.\n\nCompassionate, dramatic, and deeply moving, \"To Kill A Mockingbird\" takes readers to the roots of human behavior - to innocence and experience, kindness and cruelty, love and hatred, humor and pathos. Now with over 18 million copies in print and translated into forty languages, this regional story by a young Alabama woman claims universal appeal. Harper Lee always considered her book to be a simple love story. Today it is regarded as a masterpiece of American literature.",
        "contributions": [
          {
            "author": {
              "name": "Harper Lee"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/book_mappings/7332271/8812043fec2a92ccf3b8e361c1842a5f810509ae.jpeg"
        },
        "rating": 4.170899854862119,
        "ratings_count": 2756,
        "ratings_distribution": [
          {
            "count": 25,
            "rating": 1
          },
          {
            "count": 1,
            "rating": 1.5
          },
          {
            "count": 107,
            "rating": 2
          },
          {
            "count": 5,
            "rating": 2.5
          },
          {
            "count": 403,
            "rating": 3
          },
          {
            "count": 35,
            "rating": 3.5
          },
          {
            "count": 963,
            "rating": 4
          },
          {
            "count": 53,
            "rating": 4.5
          },
          {
            "count": 1164,
            "rating": 5
          }
        ],
        "reviews_count": 119,
        "release_year": 1960
      },
      {
        "id": 158268,
        "title": "Ender's Game",
        "description": "Ender's Game is a 1985 military science fiction novel by American author Orson Scott Card. Set at an unspecified date in Earth's future, the novel presents an imperiled humankind after two conflicts with the Formics, an insectoid alien species they dub the \"buggers\". In preparation for an anticipated third invasion, children, including the novel's protagonist, Andrew \"Ender\" Wiggin, are trained from a very young age by putting them through increasingly difficult games, including some in zero gravity, where Ender's tactical genius is revealed.\r\n\r\nThe book originated as a short story of the same name, published in the August 1977 issue of Analog Science Fiction and Fact. The novel was published on January 15, 1985. Later, by elaborating on characters and plotlines depicted in the novel, Card was able to write additional books in the Ender's Game series. Card also released an updated version of Ender's Game in 1991, changing some political facts to reflect the times more accurately (e.g., to include the recent collapse of the Soviet Union and the end of the Cold War). The novel has been translated into 34 languages.\r\n\r\nReception of the book has been mostly positive. It has become suggested reading for many military organizations, including the United States Marine Corps. Ender's Game was recognized as \"best novel\" by the 1985 Nebula Award[3] and the 1986 Hugo Award[4] in the genres of science fiction and fantasy. Its four sequels—Speaker for the Dead (1986), Xenocide (1991), Children of the Mind (1996), and Ender in Exile (2008)—follow Ender's subsequent travels to many different worlds in the galaxy. In addition, the later novella A War of Gifts (2007) and novel Ender's Shadow (1999), plus other novels in the Shadow saga, take place during the same time period as the original.\r\n\r\n\r\n----------\r\n\r\nContained in:\r\n[Ender's War](https://openlibrary.org/works/OL49619W)\r\nSee also:\r\n\r\n - [Ender's Game: 1/2](https://openlibrary.org/works/OL19647657W/Ender's_Game._1_2)\r\n\r\n  [1]: http://www.hatrack.com/osc/books/endersgame/",
        "contributions": [
          {
            "author": {
              "name": "Orson Scott Card"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/external_data/61075411/dd7e2678859a7230551382016b03219be682e693.jpeg"
        },
        "rating": 4.268055555555556,
        "ratings_count": 2160,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 28,
            "rating": 1
          },
          {
            "count": 64,
            "rating": 2
          },
          {
            "count": 4,
            "rating": 2.5
          },
          {
            "count": 247,
            "rating": 3
          },
          {
            "count": 21,
            "rating": 3.5
          },
          {
            "count": 714,
            "rating": 4
          },
          {
            "count": 46,
            "rating": 4.5
          },
          {
            "count": 1035,
            "rating": 5
          }
        ],
        "reviews_count": 95,
        "release_year": 1985
      },
      {
        "id": 159698,
        "title": "The Sea of Monsters",
        "description": "When Thalia’s tree is mysteriously poisoned, the magical borders of Camp Half-Blood begin to fail. Now Percy and his friends have just days to find the only magic item powerful to save the camp before it is overrun by monsters. The catch: they must sail into the Sea of Monsters to find it. Along the way, Percy must stage a daring rescue operation to save his old friend Grover, and he learns a terrible secret about his own family, which makes him question whether being the son of Poseidon is an honor or a curse.",
        "contributions": [
          {
            "author": {
              "name": "Rick Riordan"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/external_data/60503416/bc77fa7e47feac62202f92e90251c7dcf089c103.jpeg"
        },
        "rating": 3.9626168224299065,
        "ratings_count": 1177,
        "ratings_distribution": [
          {
            "count": 5,
            "rating": 1
          },
          {
            "count": 1,
            "rating": 1.5
          },
          {
            "count": 31,
            "rating": 2
          },
          {
            "count": 9,
            "rating": 2.5
          },
          {
            "count": 261,
            "rating": 3
          },
          {
            "count": 39,
            "rating": 3.5
          },
          {
            "count": 494,
            "rating": 4
          },
          {
            "count": 15,
            "rating": 4.5
          },
          {
            "count": 322,
            "rating": 5
          }
        ],
        "reviews_count": 87,
        "release_year": 2006
      },
      {
        "id": 175280,
        "title": "Piranesi",
        "description": "Piranesi’s house is no ordinary building: its rooms are infinite, its corridors endless, its walls are lined with thousands upon thousands of statues, each one different from all the others. Within the labyrinth of halls an ocean is imprisoned; waves thunder up staircases, rooms are flooded in an instant. But Piranesi is not afraid; he understands the tides as he understands the pattern of the labyrinth itself. He lives to explore the house.\n\nThere is one other person in the house—a man called The Other, who visits Piranesi twice a week and asks for help with research into A Great and Secret Knowledge. But as Piranesi explores, evidence emerges of another person, and a terrible truth begins to unravel, revealing a world beyond the one Piranesi has always known.",
        "contributions": [
          {
            "author": {
              "name": "Susanna Clarke"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/30480426/ec301cb7-b118-48fd-aa3a-5d336e61c182.jpg"
        },
        "rating": 4.2496339677891655,
        "ratings_count": 1366,
        "ratings_distribution": [
          {
            "count": 8,
            "rating": 1
          },
          {
            "count": 2,
            "rating": 1.5
          },
          {
            "count": 30,
            "rating": 2
          },
          {
            "count": 6,
            "rating": 2.5
          },
          {
            "count": 156,
            "rating": 3
          },
          {
            "count": 30,
            "rating": 3.5
          },
          {
            "count": 475,
            "rating": 4
          },
          {
            "count": 98,
            "rating": 4.5
          },
          {
            "count": 561,
            "rating": 5
          }
        ],
        "reviews_count": 210,
        "release_year": 2019
      },
      {
        "id": 175780,
        "title": "Catching Fire",
        "description": "Against all odds, Katniss Everdeen has won the annual Hunger Games with fellow district tribute Peeta Mellark. But it was a victory won by defiance of the Capitol and their harsh rules. Katniss and Peeta should be happy.\r\n\r\nAfter all, they have just won for themselves and their families a life of safety and plenty. But there are rumors of rebellion among the subjects, and Katniss and Peeta, to their horror, are the faces of that rebellion.\r\n\r\nThe Capitol is angry. The Capitol wants revenge. Suzanne Collins continues the amazing story of Katniss Everdeen in Catching Fire, the second novel of the phenomenal Hunger Games trilogy.\r\n([source][1])\r\n\r\n\r\n  [1]: https://www.scholastic.com/thehungergames/about-the-books.htm",
        "contributions": [
          {
            "author": {
              "name": "Suzanne Collins"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/7988314/dbef0f7db3fc4a6157550d5f7cc01563af40315c.jpeg"
        },
        "rating": 4.087192474674385,
        "ratings_count": 2764,
        "ratings_distribution": [
          {
            "count": 21,
            "rating": 1
          },
          {
            "count": 2,
            "rating": 1.5
          },
          {
            "count": 89,
            "rating": 2
          },
          {
            "count": 6,
            "rating": 2.5
          },
          {
            "count": 512,
            "rating": 3
          },
          {
            "count": 40,
            "rating": 3.5
          },
          {
            "count": 1033,
            "rating": 4
          },
          {
            "count": 66,
            "rating": 4.5
          },
          {
            "count": 995,
            "rating": 5
          }
        ],
        "reviews_count": 154,
        "release_year": 2008
      },
      {
        "id": 182003,
        "title": "The Girl on the Train",
        "description": "Rachel takes the same commuter train every morning. Every day she rattles down the track, flashes past a stretch of cozy suburban homes, and stops at the signal that allows her to daily watch the same couple breakfasting on their deck. She’s even started to feel like she knows them. “Jess and Jason,” she calls them. Their life—as she sees it—is perfect. Not unlike the life she recently lost.\r\n\r\nAnd then she sees something shocking. It’s only a minute until the train moves on, but it’s enough. Now everything’s changed. Unable to keep it to herself, Rachel offers what she knows to the police, and becomes inextricably entwined in what happens next, as well as in the lives of everyone involved. Has she done more harm than good?\r\n\r\nA compulsively readable, emotionally immersive, Hitchcockian thriller that draws comparisons to Gone Girl, The Silent Wife, or Before I Go to Sleep, this is an electrifying debut embraced by readers across markets and categories (Goodreads).",
        "contributions": [
          {
            "author": {
              "name": "Paula Hawkins"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/30399545/22a077d7c5cc34bf31fd72d67ed7286796ea73dc.jpeg"
        },
        "rating": 3.5049059689288633,
        "ratings_count": 1223,
        "ratings_distribution": [
          {
            "count": 33,
            "rating": 1
          },
          {
            "count": 1,
            "rating": 1.5
          },
          {
            "count": 155,
            "rating": 2
          },
          {
            "count": 9,
            "rating": 2.5
          },
          {
            "count": 373,
            "rating": 3
          },
          {
            "count": 18,
            "rating": 3.5
          },
          {
            "count": 429,
            "rating": 4
          },
          {
            "count": 7,
            "rating": 4.5
          },
          {
            "count": 198,
            "rating": 5
          }
        ],
        "reviews_count": 178,
        "release_year": 2014
      },
      {
        "id": 187993,
        "title": "The Silent Patient",
        "description": "Alicia Berenson’s life is seemingly perfect. A famous painter married to an in-demand fashion photographer, she lives in a grand house with big windows overlooking a park in one of London’s most desirable areas. One evening her husband Gabriel returns home late from a fashion shoot, and Alicia shoots him five times in the face, and then never speaks another word.\n\nAlicia’s refusal to talk, or give any kind of explanation, turns a domestic tragedy into something far grander, a mystery that captures the public imagination and casts Alicia into notoriety. The price of her art skyrockets, and she, the silent patient, is hidden away from the tabloids and spotlight at the Grove, a secure forensic unit in North London.\n\nTheo Faber is a criminal psychotherapist who has waited a long time for the opportunity to work with Alicia. His determination to get her to talk and unravel the mystery of why she shot her husband takes him down a twisting path into his own motivations—a search for the truth that threatens to consume him....",
        "contributions": [
          {
            "author": {
              "name": "Alex Michaelides"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/external_data/28751974/54f369b67424945df1b49396bf565090979b4ef3.jpeg"
        },
        "rating": 3.7936329588014983,
        "ratings_count": 1335,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 26,
            "rating": 1
          },
          {
            "count": 5,
            "rating": 1.5
          },
          {
            "count": 93,
            "rating": 2
          },
          {
            "count": 19,
            "rating": 2.5
          },
          {
            "count": 291,
            "rating": 3
          },
          {
            "count": 58,
            "rating": 3.5
          },
          {
            "count": 471,
            "rating": 4
          },
          {
            "count": 36,
            "rating": 4.5
          },
          {
            "count": 335,
            "rating": 5
          }
        ],
        "reviews_count": 234,
        "release_year": 2018
      },
      {
        "id": 188628,
        "title": "Foundation",
        "description": "One of the great masterworks of science fiction, the Foundation novels of Isaac Asimov are unsurpassed for their unique blend of nonstop action, daring ideas, and extensive world-building. \r\n\r\nThe story of our future begins with the history of Foundation and its greatest psychohistorian: Hari Seldon.  For twelve thousand years the Galactic Empire has ruled supreme. Now it is dying.  Only Hari Seldon, creator of the revolutionary science of psychohistory, can see into the future--a dark age of ignorance, barbarism, and warfare that will last thirty thousand years. To preserve knowledge and save mankind, Seldon gathers the best minds in the Empire--both scientists and scholars--and brings them to a bleak planet at the edge of the Galaxy to serve as a beacon of hope for future generations. He calls his sanctuary the Foundation.\r\n\r\nBut soon the fledgling Foundation finds itself at the mercy of corrupt warlords rising in the wake of the receding Empire. And mankind's last best hope is faced with an agonizing choice: submit to the barbarians and live as slaves--or take a stand for freedom and risk total destruction.",
        "contributions": [
          {
            "author": {
              "name": "Isaac Asimov"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/30404892/5661545646660324.jpg"
        },
        "rating": 3.9917840375586855,
        "ratings_count": 1278,
        "ratings_distribution": [
          {
            "count": 18,
            "rating": 1
          },
          {
            "count": 65,
            "rating": 2
          },
          {
            "count": 5,
            "rating": 2.5
          },
          {
            "count": 248,
            "rating": 3
          },
          {
            "count": 16,
            "rating": 3.5
          },
          {
            "count": 475,
            "rating": 4
          },
          {
            "count": 28,
            "rating": 4.5
          },
          {
            "count": 423,
            "rating": 5
          }
        ],
        "reviews_count": 89,
        "release_year": 1951
      },
      {
        "id": 197990,
        "title": "The Fault in Our Stars",
        "description": "Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a gorgeous plot twist named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel’s story is about to be completely rewritten.\r\n\r\nInsightful, bold, irreverent, and raw, The Fault in Our Stars is award-winning-author John Green’s most ambitious and heartbreaking work yet, brilliantly exploring the funny, thrilling, and tragic business of being alive and in love.",
        "contributions": [
          {
            "author": {
              "name": "John Green"
            }
          },
          {
            "author": {
              "name": "Fabiola Stevenson"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/external_data/42441742/f0fe7614243ae255ef797f894e263adeb97cd666.jpeg"
        },
        "rating": 3.911080332409972,
        "ratings_count": 1806,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 42,
            "rating": 1
          },
          {
            "count": 5,
            "rating": 1.5
          },
          {
            "count": 124,
            "rating": 2
          },
          {
            "count": 5,
            "rating": 2.5
          },
          {
            "count": 362,
            "rating": 3
          },
          {
            "count": 30,
            "rating": 3.5
          },
          {
            "count": 614,
            "rating": 4
          },
          {
            "count": 18,
            "rating": 4.5
          },
          {
            "count": 605,
            "rating": 5
          }
        ],
        "reviews_count": 167,
        "release_year": 2012
      },
      {
        "id": 208339,
        "title": "The Three-Body Problem",
        "description": "The Three-Body Problem is the first novel in the groundbreaking, Hugo Award-winning series from China's most beloved science fiction author, Cixin Liu.\n\nSet against the backdrop of China's Cultural Revolution, a secret military project sends signals into space to establish contact with aliens. An alien civilization on the brink of destruction captures the signal and plans to invade Earth. Meanwhile, on Earth, different camps start forming, planning to either welcome the superior beings and help them take over a world seen as corrupt, or to fight against the invasion. The result is a science fiction masterpiece of enormous scope and vision.",
        "contributions": [
          {
            "author": {
              "name": "Cixin Liu"
            }
          },
          {
            "author": {
              "name": "Ken Liu"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/30394943/198246c4-1961-4f80-8acd-cb922cc9860e-three.jpg"
        },
        "rating": 3.9436026936026938,
        "ratings_count": 1782,
        "ratings_distribution": [
          {
            "count": 19,
            "rating": 1
          },
          {
            "count": 3,
            "rating": 1.5
          },
          {
            "count": 89,
            "rating": 2
          },
          {
            "count": 13,
            "rating": 2.5
          },
          {
            "count": 355,
            "rating": 3
          },
          {
            "count": 52,
            "rating": 3.5
          },
          {
            "count": 669,
            "rating": 4
          },
          {
            "count": 79,
            "rating": 4.5
          },
          {
            "count": 503,
            "rating": 5
          }
        ],
        "reviews_count": 210,
        "release_year": 2006
      },
      {
        "id": 219252,
        "title": "The Lightning Thief",
        "description": "Twelve-year-old Percy Jackson is on the most dangerous quest of his life.  With the help of a satyr and a daughter of Athena, Percy must journey across the United States to catch a thief who has stolen the original weapon of mass destruction—Zeus’ master bolt.  Along the way, he must face a host of mythological enemies determined to stop him.  Most of all, he must come to terms with a father he has never known, and an Oracle that has warned him of betrayal by a friend.",
        "contributions": [
          {
            "author": {
              "name": "Rick Riordan"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/775810/f8e87fe8cc17eb4ed4492a028108ff48925a25ec.jpeg"
        },
        "rating": 4.039480387162507,
        "ratings_count": 1963,
        "ratings_distribution": [
          {
            "count": 13,
            "rating": 1
          },
          {
            "count": 1,
            "rating": 1.5
          },
          {
            "count": 78,
            "rating": 2
          },
          {
            "count": 11,
            "rating": 2.5
          },
          {
            "count": 366,
            "rating": 3
          },
          {
            "count": 28,
            "rating": 3.5
          },
          {
            "count": 773,
            "rating": 4
          },
          {
            "count": 43,
            "rating": 4.5
          },
          {
            "count": 650,
            "rating": 5
          }
        ],
        "reviews_count": 165,
        "release_year": 2000
      },
      {
        "id": 249097,
        "title": "This Is How You Lose the Time War",
        "description": "Two time-traveling agents from warring futures, working their way through the past, begin to exchange letters—and fall in love in this thrilling and romantic book from award-winning authors Amal El-Mohtar and Max Gladstone.\r\n\r\nIn the ashes of a dying world, Red finds a letter marked “Burn before reading. Signed, Blue.”\r\n\r\nSo begins an unlikely correspondence between two rival agents in a war that stretches through the vast reaches of time and space.\r\n\r\nRed belongs to the Agency, a post-singularity technotopia. Blue belongs to Garden, a single vast consciousness embedded in all organic matter. Their pasts are bloody and their futures mutually exclusive. They have nothing in common—save that they’re the best, and they’re alone.\r\n\r\nNow what began as a battlefield boast grows into a dangerous game, one both Red and Blue are determined to win. Because winning’s what you do in war. Isn’t it?\r\n\r\nA tour de force collaboration from two powerhouse writers that spans the whole of time and space.",
        "contributions": [
          {
            "author": {
              "name": "Amal El-Mohtar"
            }
          },
          {
            "author": {
              "name": "Max Gladstone"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/external_data/44167565/5598741495c3051d098d0434d63e4ce390451948.jpeg"
        },
        "rating": 3.871112929623568,
        "ratings_count": 1222,
        "ratings_distribution": [
          {
            "count": 2,
            "rating": 0.5
          },
          {
            "count": 26,
            "rating": 1
          },
          {
            "count": 5,
            "rating": 1.5
          },
          {
            "count": 99,
            "rating": 2
          },
          {
            "count": 16,
            "rating": 2.5
          },
          {
            "count": 216,
            "rating": 3
          },
          {
            "count": 45,
            "rating": 3.5
          },
          {
            "count": 382,
            "rating": 4
          },
          {
            "count": 61,
            "rating": 4.5
          },
          {
            "count": 370,
            "rating": 5
          }
        ],
        "reviews_count": 233,
        "release_year": 2019
      },
      {
        "id": 262039,
        "title": "The Giver",
        "description": "Given his lifetime assignment at the Ceremony of Twelve, Jonas becomes the receiver of memories shared by only one other in his community and discovers the terrible truth about the society in which he lives.",
        "contributions": [
          {
            "author": {
              "name": "Lois Lowry"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/30401086/ed0a01eaa3c1c3f1b1937c94963c51709e2eb165.jpeg"
        },
        "rating": 3.9777568922305764,
        "ratings_count": 1596,
        "ratings_distribution": [
          {
            "count": 22,
            "rating": 1
          },
          {
            "count": 1,
            "rating": 1.5
          },
          {
            "count": 75,
            "rating": 2
          },
          {
            "count": 7,
            "rating": 2.5
          },
          {
            "count": 327,
            "rating": 3
          },
          {
            "count": 23,
            "rating": 3.5
          },
          {
            "count": 601,
            "rating": 4
          },
          {
            "count": 16,
            "rating": 4.5
          },
          {
            "count": 524,
            "rating": 5
          }
        ],
        "reviews_count": 91,
        "release_year": 1993
      },
      {
        "id": 266084,
        "title": "The Stranger",
        "description": "With the intrigue of a psychological thriller, The Stranger—Camus's masterpiece—gives us the story of an ordinary man unwittingly drawn into a senseless murder on an Algerian beach. With an Introduction by Peter Dunwoodie; translated by Matthew Ward. Behind the subterfuge, Camus explores what he termed \"the nakedness of man faced with the absurd\" and describes the condition of reckless alienation and spiritual exhaustion that characterized so much of twentieth-century life. “The Stranger is a strikingly modern text and Matthew Ward’s translation will enable readers to appreciate why Camus’s stoical anti-hero and ­devious narrator remains one of the key expressions of a postwar Western malaise, and one of the cleverest exponents of a literature of ambiguity.” –from the Introduction by Peter Dunwoodie First published in 1946; now in translation by Matthew Ward.",
        "contributions": [
          {
            "author": {
              "name": "Albert Camus"
            }
          },
          {
            "author": {
              "name": "Matthew Ward"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/external_data/60312166/8578c1362e1b2d64fc867cc4b84178b7b8231e3d.jpeg"
        },
        "rating": 3.931118881118881,
        "ratings_count": 1430,
        "ratings_distribution": [
          {
            "count": 17,
            "rating": 1
          },
          {
            "count": 86,
            "rating": 2
          },
          {
            "count": 11,
            "rating": 2.5
          },
          {
            "count": 262,
            "rating": 3
          },
          {
            "count": 45,
            "rating": 3.5
          },
          {
            "count": 562,
            "rating": 4
          },
          {
            "count": 43,
            "rating": 4.5
          },
          {
            "count": 404,
            "rating": 5
          }
        ],
        "reviews_count": 117,
        "release_year": 1942
      },
      {
        "id": 280359,
        "title": "The Shining",
        "description": "Jack Torrance's new job at the Overlook Hotel is the perfect chance for a fresh start. As the off-season caretaker at the atmospheric old hotel, he'll have plenty of time to spend reconnecting with his family and working on his writing. But as the harsh winter weather sets in, the idyllic location feels ever more remote...and more sinister. And the only one to notice the strange and terrible forces gathering around the Overlook is Danny Torrance, a uniquely gifted five-year-old.",
        "contributions": [
          {
            "author": {
              "name": "Stephen King"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/external_data/60144154/0e1063deb6ab9d053fed3a086d83556198c9c7b3.jpeg"
        },
        "rating": 4.122709163346613,
        "ratings_count": 1255,
        "ratings_distribution": [
          {
            "count": 13,
            "rating": 1
          },
          {
            "count": 40,
            "rating": 2
          },
          {
            "count": 7,
            "rating": 2.5
          },
          {
            "count": 185,
            "rating": 3
          },
          {
            "count": 17,
            "rating": 3.5
          },
          {
            "count": 496,
            "rating": 4
          },
          {
            "count": 40,
            "rating": 4.5
          },
          {
            "count": 457,
            "rating": 5
          }
        ],
        "reviews_count": 92,
        "release_year": 1977
      },
      {
        "id": 292354,
        "title": "The Martian",
        "description": "Six days ago, astronaut Mark Watney became one of the first people to walk on Mars.\r\n\r\nNow he's sure he'll be the first person to die there.\r\n\r\nAfter a dust storm nearly kills him and forces his crew to evacuate the planet while thinking him dead, Mark finds himself stranded on Mars' surface, completely alone. with no way to signal Earth that he's alive. And even if he could get word out, his supplies would be gone years before a rescue could arrive.\r\n\r\nChances are, though, Mark won't have time to starve to death. The damaged machinery, unforgiving environment, or plain-old \"human error\" are much more likely to kill him first. But Mark's not ready to quit. Armed with nothing but his ingenuity and his engineering skills—and a gallows sense of humor that proves to be his greatest source of strength—he embarks on a dogged quest to stay alive, using his botany expertise to grow food and even hatch- ing a mad plan to contact NASA back on Earth.\r\n\r\nAs he overcomes one seemingly insurmountable obstacle after the next, Mark begins to let himself believe he might make it off the planet alive.\r\n\r\nBut Mars has plenty of surprises in store for him yet.\r\n\r\nGrounded in real, present-day science from the first page to the last. yet propelled by a brilliantly ingenious plot that surprises the reader again and again, The Martian is a truly remarkable thriller: an impossible-to- put-down suspense novel that manages tc read like a real-life survival tale.\r\n--front flap",
        "contributions": [
          {
            "author": {
              "name": "Andy Weir"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/21716111/5323176149970177.jpg"
        },
        "rating": 4.427056196501675,
        "ratings_count": 2687,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 10,
            "rating": 1
          },
          {
            "count": 1,
            "rating": 1.5
          },
          {
            "count": 44,
            "rating": 2
          },
          {
            "count": 6,
            "rating": 2.5
          },
          {
            "count": 205,
            "rating": 3
          },
          {
            "count": 33,
            "rating": 3.5
          },
          {
            "count": 840,
            "rating": 4
          },
          {
            "count": 90,
            "rating": 4.5
          },
          {
            "count": 1457,
            "rating": 5
          }
        ],
        "reviews_count": 284,
        "release_year": 2011
      },
      {
        "id": 300042,
        "title": "The Book Thief",
        "description": "Trying to make sense of the horrors of World War II, Death relates the story of Liesel--a young German girl whose book-stealing and story-telling talents help sustain her family and the Jewish man they are hiding, as well as their neighbors.",
        "contributions": [
          {
            "author": {
              "name": "Markus Zusak"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/30399827/3081662300594446.jpg"
        },
        "rating": 4.311475409836065,
        "ratings_count": 1342,
        "ratings_distribution": [
          {
            "count": 17,
            "rating": 1
          },
          {
            "count": 45,
            "rating": 2
          },
          {
            "count": 1,
            "rating": 2.5
          },
          {
            "count": 153,
            "rating": 3
          },
          {
            "count": 11,
            "rating": 3.5
          },
          {
            "count": 385,
            "rating": 4
          },
          {
            "count": 22,
            "rating": 4.5
          },
          {
            "count": 708,
            "rating": 5
          }
        ],
        "reviews_count": 155,
        "release_year": 2005
      },
      {
        "id": 302088,
        "title": "Twilight",
        "description": "Fall in love with the addictive, suspenseful love story between a teenage girl and a vampire with the book that sparked a \"literary phenomenon\" and redefined romance for a generation (New York Times).\n\nIsabella Swan's move to Forks, a small, perpetually rainy town in Washington, could have been the most boring move she ever made. But once she meets the mysterious and alluring Edward Cullen, Isabella's life takes a thrilling and terrifying turn.\nUp until now, Edward has managed to keep his vampire identity a secret in the small community he lives in, but now nobody is safe, especially Isabella, the person Edward holds most dear. The lovers find themselves balanced precariously on the point of a knife -- between desire and danger.\nDeeply romantic and extraordinarily suspenseful, Twilight captures the struggle between defying our instincts and satisfying our desires. This is a love story with bite.\nIt's here! #1 bestselling author Stephenie Meyer makes a triumphant return to the world of Twilight with the highly anticipated companion, Midnight Sun: the iconic love story of Bella and Edward told from the vampire's point of view.\n\n\"People do not want to just read Meyer's books; they want to climb inside them and live there.\" -- Time\n\n\"A literary phenomenon.\" -- The New York Times",
        "contributions": [
          {
            "author": {
              "name": "Stephenie Meyer"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/19228247/0e4edc828d09c7efd08df09e37b04aab3f4026dd.jpeg"
        },
        "rating": 2.884492830589485,
        "ratings_count": 1884,
        "ratings_distribution": [
          {
            "count": 3,
            "rating": 0.5
          },
          {
            "count": 338,
            "rating": 1
          },
          {
            "count": 6,
            "rating": 1.5
          },
          {
            "count": 384,
            "rating": 2
          },
          {
            "count": 14,
            "rating": 2.5
          },
          {
            "count": 510,
            "rating": 3
          },
          {
            "count": 16,
            "rating": 3.5
          },
          {
            "count": 362,
            "rating": 4
          },
          {
            "count": 10,
            "rating": 4.5
          },
          {
            "count": 241,
            "rating": 5
          }
        ],
        "reviews_count": 116,
        "release_year": 2005
      },
      {
        "id": 312460,
        "title": "Dune",
        "description": "Set on the desert planet Arrakis, Dune is the story of Paul Atreides--who would become known as Muad'Dib--and of a great family's ambition to bring to fruition mankind's most ancient and unattainable dream.\nA stunning blend of adventure and mysticism, environmentalism and politics, Dune won the first Nebula Award, shared the Hugo Award, and formed the basis of what is undoubtedly the grandest epic in science fiction.",
        "contributions": [
          {
            "author": {
              "name": "Frank Herbert"
            }
          },
          {
            "author": {
              "name": "Brian Herbert"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/30426415/8362709973192601-9780441013593-us.jpg"
        },
        "rating": 4.293267651888342,
        "ratings_count": 3045,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 18,
            "rating": 1
          },
          {
            "count": 3,
            "rating": 1.5
          },
          {
            "count": 89,
            "rating": 2
          },
          {
            "count": 10,
            "rating": 2.5
          },
          {
            "count": 299,
            "rating": 3
          },
          {
            "count": 55,
            "rating": 3.5
          },
          {
            "count": 1019,
            "rating": 4
          },
          {
            "count": 147,
            "rating": 4.5
          },
          {
            "count": 1404,
            "rating": 5
          }
        ],
        "reviews_count": 246,
        "release_year": 1965
      },
      {
        "id": 316971,
        "title": "Eragon",
        "description": "When fifteen-year-old Eragon finds a polished blue stone in the forest, he thinks it is the lucky discovery of a poor farm boy. But when the stone brings a dragon hatchling, Eragon soon realizes he has stumbled upon a legacy nearly as old as the Empire itself.\n\nOvernight his simple life is shattered, and, gifted with only an ancient sword, a loyal dragon, and sage advice from an old storyteller, Eragon is soon swept into a dangerous tapestry of magic, glory, and power. Now his choices could save—or destroy—the Empire.",
        "contributions": [
          {
            "author": {
              "name": "Christopher Paolini"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/30399869/8816624490580869-91JrDpvTiML._SL1500_.jpg"
        },
        "rating": 3.646034099332839,
        "ratings_count": 1349,
        "ratings_distribution": [
          {
            "count": 61,
            "rating": 1
          },
          {
            "count": 131,
            "rating": 2
          },
          {
            "count": 5,
            "rating": 2.5
          },
          {
            "count": 334,
            "rating": 3
          },
          {
            "count": 23,
            "rating": 3.5
          },
          {
            "count": 465,
            "rating": 4
          },
          {
            "count": 19,
            "rating": 4.5
          },
          {
            "count": 311,
            "rating": 5
          }
        ],
        "reviews_count": 47,
        "release_year": 2002
      },
      {
        "id": 328491,
        "title": "Harry Potter and the Sorcerer's Stone",
        "description": "Harry Potter has never been the star of a Quidditch team, scoring points while riding a broom far above the ground. He knows no spells, has never helped to hatch a dragon, and has never worn a cloak of invisibility.\n\nAll he knows is a miserable life with the Dursleys, his horrible aunt and uncle, and their abominable son, Dudley - a great big swollen spoiled bully. Harry's room is a tiny closet at the foot of the stairs, and he hasn't had a birthday party in eleven years.\n\nBut all that is about to change when a mysterious letter arrives by owl messenger: a letter with an invitation to an incredible place that Harry - and anyone who reads about him - will find unforgettable.\n\nFor it's there that he finds not only friends, aerial sports, and magic in everything from classes to meals, but a great destiny that's been waiting for him... if Harry can survive the encounter.",
        "contributions": [
          {
            "author": {
              "name": "J. K. Rowling"
            }
          },
          {
            "author": {
              "name": "Mary GrandPré"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/3890025/4883525795702759-58613380.jpg"
        },
        "rating": 4.273531699727733,
        "ratings_count": 5142,
        "ratings_distribution": [
          {
            "count": 9,
            "rating": 0.5
          },
          {
            "count": 38,
            "rating": 1
          },
          {
            "count": 5,
            "rating": 1.5
          },
          {
            "count": 111,
            "rating": 2
          },
          {
            "count": 22,
            "rating": 2.5
          },
          {
            "count": 642,
            "rating": 3
          },
          {
            "count": 91,
            "rating": 3.5
          },
          {
            "count": 1666,
            "rating": 4
          },
          {
            "count": 102,
            "rating": 4.5
          },
          {
            "count": 2456,
            "rating": 5
          }
        ],
        "reviews_count": 228,
        "release_year": 1989
      },
      {
        "id": 337236,
        "title": "The Alchemist",
        "description": "Combining magic, mysticism, wisdom and wonder into an inspiring tale of self-discovery, The Alchemist has become a modern classic, selling millions of copies around the world and transforming the lives of countless readers across generations.\n\nPaulo Coelho's masterpiece tells the mystical story of Santiago, an Andalusian shepherd boy who yearns to travel in search of a worldly treasure. His quest will lead him to riches far different—and far more satisfying—than he ever imagined. Santiago's journey teaches us about the essential wisdom of listening to our hearts, of recognizing opportunity and learning to read the omens strewn along life's path, and, most importantly, to follow our dreams.",
        "contributions": [
          {
            "author": {
              "name": "Paulo Coelho"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/30399646/6724991536065856.jpg"
        },
        "rating": 3.5099557522123894,
        "ratings_count": 1808,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 131,
            "rating": 1
          },
          {
            "count": 3,
            "rating": 1.5
          },
          {
            "count": 223,
            "rating": 2
          },
          {
            "count": 14,
            "rating": 2.5
          },
          {
            "count": 444,
            "rating": 3
          },
          {
            "count": 28,
            "rating": 3.5
          },
          {
            "count": 509,
            "rating": 4
          },
          {
            "count": 24,
            "rating": 4.5
          },
          {
            "count": 431,
            "rating": 5
          }
        ],
        "reviews_count": 142,
        "release_year": 1988
      },
      {
        "id": 340654,
        "title": "The Seven Husbands of Evelyn Hugo",
        "description": "Aging and reclusive Hollywood movie icon Evelyn Hugo is finally ready to tell the truth about her glamorous and scandalous life. But when she chooses unknown magazine reporter Monique Grant for the job, no one is more astounded than Monique herself. Why her? Why now?\r\n\r\nMonique is not exactly on top of the world. Her husband has left her, and her professional life is going nowhere. Regardless of why Evelyn has selected her to write her biography, Monique is determined to use this opportunity to jumpstart her career.\r\n\r\nSummoned to Evelyn's luxurious apartment, Monique listens in fascination as the actress tells her story. From making her way to Los Angeles in the 1950s to her decision to leave show business in the '80s, and, of course, the seven husbands along the way, Evelyn unspools a tale of ruthless ambition, unexpected friendship, and a great forbidden love. Monique begins to feel a very real connection to the legendary star, but as Evelyn's story near its conclusion, it becomes clear that her life intersects with Monique's own in tragic and irreversible ways.\r\n\r\nWritten with Reid's signature talent for creating \"complex, likable characters\" (Real Simple), this is a mesmerizing journey through the splendor of old Hollywood into the harsh realities of the present day as two women struggle with what it means—and what it costs—to face the truth",
        "contributions": [
          {
            "author": {
              "name": "Taylor Jenkins Reid"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/30400854/26c67fc06856b60a465680539c0c0b327be861de.jpeg"
        },
        "rating": 4.285794497473329,
        "ratings_count": 1781,
        "ratings_distribution": [
          {
            "count": 4,
            "rating": 0.5
          },
          {
            "count": 18,
            "rating": 1
          },
          {
            "count": 5,
            "rating": 1.5
          },
          {
            "count": 41,
            "rating": 2
          },
          {
            "count": 11,
            "rating": 2.5
          },
          {
            "count": 168,
            "rating": 3
          },
          {
            "count": 49,
            "rating": 3.5
          },
          {
            "count": 559,
            "rating": 4
          },
          {
            "count": 91,
            "rating": 4.5
          },
          {
            "count": 835,
            "rating": 5
          }
        ],
        "reviews_count": 321,
        "release_year": 2017
      },
      {
        "id": 355708,
        "title": "The Golden Compass",
        "description": "Lyra is rushing to the cold, far North, where witch clans and armored bears rule. North, where the Gobblers take the children they steal—including her friend Roger. North, where her fearsome uncle Asriel is trying to build a bridge to a parallel world.\n\nCan one small girl make a difference in such great and terrible endeavors? This is Lyra: a savage, a schemer, a liar, and as fierce and true a champion as Roger or Asriel could want.\n\nBut what Lyra doesn't know is that to help one of them will be to betray the other...\n\nA masterwork of storytelling and suspense, Philip Pullman's award-winning The Golden Compass is the first in the His Dark Materials series, which continues with The Subtle Knife and The Amber Spyglass.",
        "contributions": [
          {
            "author": {
              "name": "Philip Pullman"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/19151716/902688047208777-119322.jpg"
        },
        "rating": 4.012251655629139,
        "ratings_count": 1510,
        "ratings_distribution": [
          {
            "count": 25,
            "rating": 1
          },
          {
            "count": 87,
            "rating": 2
          },
          {
            "count": 2,
            "rating": 2.5
          },
          {
            "count": 262,
            "rating": 3
          },
          {
            "count": 14,
            "rating": 3.5
          },
          {
            "count": 572,
            "rating": 4
          },
          {
            "count": 17,
            "rating": 4.5
          },
          {
            "count": 531,
            "rating": 5
          }
        ],
        "reviews_count": 69,
        "release_year": 1995
      },
      {
        "id": 356467,
        "title": "Animal Farm",
        "description": "Animal Farm is a brilliant political satire and a powerful and affecting story of revolutions and idealism, power and corruption. 'All animals are equal. But some animals are more equal than others.' Mr Jones of Manor Farm is so lazy and drunken that one day he forgets to feed his livestock. The ensuing rebellion under the leadership of the pigs Napoleon and Snowball leads to the animals taking over the farm. Vowing to eliminate the terrible inequities of the farmyard, the renamed Animal Farm is organised to benefit all who walk on four legs. But as time passes, the ideals of the rebellion are corrupted, then forgotten. And something new and unexpected emerges..",
        "contributions": [
          {
            "author": {
              "name": "George Orwell"
            }
          },
          {
            "author": {
              "name": "Russell Baker"
            }
          },
          {
            "author": {
              "name": "C.M. Woodhouse"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/8875000/50724b8328716dc6927469420ab2b2b7cd42cc76.jpeg"
        },
        "rating": 4.044491525423728,
        "ratings_count": 3304,
        "ratings_distribution": [
          {
            "count": 2,
            "rating": 0.5
          },
          {
            "count": 44,
            "rating": 1
          },
          {
            "count": 3,
            "rating": 1.5
          },
          {
            "count": 121,
            "rating": 2
          },
          {
            "count": 14,
            "rating": 2.5
          },
          {
            "count": 538,
            "rating": 3
          },
          {
            "count": 91,
            "rating": 3.5
          },
          {
            "count": 1304,
            "rating": 4
          },
          {
            "count": 94,
            "rating": 4.5
          },
          {
            "count": 1093,
            "rating": 5
          }
        ],
        "reviews_count": 199,
        "release_year": 1945
      },
      {
        "id": 369692,
        "title": "Mistborn: The Final Empire",
        "description": "What if the whole world were a dead, blasted wasteland?\r\n\r\nMistborn\r\nFor a thousand years the ash fell and no flowers bloomed. For a thousand years the Skaa slaved in misery and lived in fear. For a thousand years the Lord Ruler, the \"Sliver of Infinity,\" reigned with absolute power and ultimate terror, divinely invincible. Then, when hope was so long lost that not even its memory remained, a terribly scarred, heart-broken half-Skaa rediscovered it in the depths of the Lord Ruler's most hellish prison. Kelsier \"snapped\" and found in himself the powers of a Mistborn. A brilliant thief and natural leader, he turned his talents to the ultimate caper, with the Lord Ruler himself as the mark.\r\n\r\nKelsier recruited the underworld's elite, the smartest and most trustworthy allomancers, each of whom shares one of his many powers, and all of whom relish a high-stakes challenge. Then Kelsier reveals his ultimate dream, not just the greatest heist in history, but the downfall of the divine despot.\r\n\r\nBut even with the best criminal crew ever assembled, Kel's plan looks more like the ultimate long shot, until luck brings a ragged girl named Vin into his life. Like him, she's a half-Skaa orphan, but she's lived a much harsher life. Vin has learned to expect betrayal from everyone she meets. She will have to learn trust if Kel is to help her master powers of which she never dreamed.\r\n\r\nBrandon Sanderson, fantasy's newest master tale-spinner and author of the acclaimed debut Elantris, dares to turn a genre on its head by asking a simple question: What if the prophesied hero failed to defeat the Dark Lord? The answer will be found in the Misborn Trilogy, a saga of surprises that begins with the book in your hands. Fantasy will never be the same again.",
        "contributions": [
          {
            "author": {
              "name": "Brandon Sanderson"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/30661331/26b9937f98d3884c53af4b685504e9577bca036e.jpeg"
        },
        "rating": 4.460563955864323,
        "ratings_count": 2447,
        "ratings_distribution": [
          {
            "count": 7,
            "rating": 1
          },
          {
            "count": 3,
            "rating": 1.5
          },
          {
            "count": 28,
            "rating": 2
          },
          {
            "count": 7,
            "rating": 2.5
          },
          {
            "count": 138,
            "rating": 3
          },
          {
            "count": 38,
            "rating": 3.5
          },
          {
            "count": 771,
            "rating": 4
          },
          {
            "count": 152,
            "rating": 4.5
          },
          {
            "count": 1303,
            "rating": 5
          }
        ],
        "reviews_count": 266,
        "release_year": 2006
      },
      {
        "id": 373163,
        "title": "The Da Vinci Code",
        "description": "The Da Vinci Code is a 2003 mystery thriller novel by Dan Brown. It is Brown's second novel to include the character Robert Langdon: the first was his 2000 novel Angels & Demons. \n\nThe Da Vinci Code follows \"symbologist\" Robert Langdon and cryptologist Sophie Neveu after a murder in the Louvre Museum in Paris causes them to become involved in a battle between the Priory of Sion and Opus Dei over the possibility of Jesus Christ and Mary Magdalene having had a child together.",
        "contributions": [
          {
            "author": {
              "name": "Dan Brown"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/30400169/2520023766251547.jpeg"
        },
        "rating": 3.5704070407040702,
        "ratings_count": 1818,
        "ratings_distribution": [
          {
            "count": 2,
            "rating": 0.5
          },
          {
            "count": 93,
            "rating": 1
          },
          {
            "count": 2,
            "rating": 1.5
          },
          {
            "count": 195,
            "rating": 2
          },
          {
            "count": 8,
            "rating": 2.5
          },
          {
            "count": 461,
            "rating": 3
          },
          {
            "count": 8,
            "rating": 3.5
          },
          {
            "count": 665,
            "rating": 4
          },
          {
            "count": 14,
            "rating": 4.5
          },
          {
            "count": 370,
            "rating": 5
          }
        ],
        "reviews_count": 50,
        "release_year": 2003
      },
      {
        "id": 373402,
        "title": "Six of Crows",
        "description": "Ketterdam: a bustling hub of international trade where anything can be had for the right price–and no one knows that better than criminal prodigy Kaz Brekker. Kaz is offered a chance at a deadly heist that could make him rich beyond his wildest dreams. But he can’t pull it off alone…\n\nA convict with a thirst for revenge.\nA sharpshooter who can’t walk away from a wager.\nA runaway with a privileged past.\nA spy known as the Wraith.\nA Heartrender using her magic to survive the slums.\nA thief with a gift for unlikely escapes.\n\nSix dangerous outcasts. One impossible heist. Kaz’s crew is the only thing that might stand between the world and destruction—if they don’t kill each other first.",
        "contributions": [
          {
            "author": {
              "name": "Leigh Bardugo"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/book_mappings/7332359/142e2ae1b4ad7375fdedc9200564c9b3b21cb117.jpeg"
        },
        "rating": 4.303855825649623,
        "ratings_count": 1193,
        "ratings_distribution": [
          {
            "count": 9,
            "rating": 1
          },
          {
            "count": 1,
            "rating": 1.5
          },
          {
            "count": 21,
            "rating": 2
          },
          {
            "count": 5,
            "rating": 2.5
          },
          {
            "count": 137,
            "rating": 3
          },
          {
            "count": 21,
            "rating": 3.5
          },
          {
            "count": 390,
            "rating": 4
          },
          {
            "count": 40,
            "rating": 4.5
          },
          {
            "count": 569,
            "rating": 5
          }
        ],
        "reviews_count": 197,
        "release_year": 2015
      },
      {
        "id": 374051,
        "title": "And Then There Were None",
        "description": "And Then There Were None is the signature novel of Agatha Christie, the most beloved work of the world's bestselling novelist. It is a masterpiece of mystery and suspense that has been a fixture in popular literature for more than sixty years, a brilliant tale that remains as compelling today as ever. \n\nFirst there were ten—a curious assortment of strangers summoned as weekend guests to a private island off the-coast of Devon. Their host, an eccentric millionaire unknown to any of them, is nowhere to be found. All that the guests have in common is a wicked past they're unwilling to reveal—and a secret that will seal their fate. For each has been marked for murder, and one by one they begin to fall prey to an unseen hand. As the only people on the island, unable to leave and unable to call for help, they know that the only possible suspects are among their number. And only the dead are above suspicion.\n\nAlso published as \"Ten Little Indians\"",
        "contributions": [
          {
            "author": {
              "name": "Agatha Christie"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/26939988/4489646938598107-16299.jpg"
        },
        "rating": 4.248463901689708,
        "ratings_count": 1302,
        "ratings_distribution": [
          {
            "count": 5,
            "rating": 1
          },
          {
            "count": 24,
            "rating": 2
          },
          {
            "count": 5,
            "rating": 2.5
          },
          {
            "count": 159,
            "rating": 3
          },
          {
            "count": 25,
            "rating": 3.5
          },
          {
            "count": 496,
            "rating": 4
          },
          {
            "count": 45,
            "rating": 4.5
          },
          {
            "count": 543,
            "rating": 5
          }
        ],
        "reviews_count": 123,
        "release_year": 1939
      },
      {
        "id": 374131,
        "title": "Words of Radiance",
        "description": "Expected by his enemies to die the miserable death of a military slave, Kaladin survived to be given command of the royal bodyguards, a controversial first for a low-status \"darkeyes.\" Now he must protect the king and Dalinar from every common peril as well as the distinctly uncommon threat of the Assassin, all while secretly struggling to master remarkable new powers that are somehow linked to his honorspren, Syl.\n\nThe Assassin, Szeth, is active again, murdering rulers all over the world of Roshar, using his baffling powers to thwart every bodyguard and elude all pursuers. Among his prime targets is Highprince Dalinar, widely considered the power behind the Alethi throne. His leading role in the war would seem reason enough, but the Assassin's master has much deeper motives.\n\nBrilliant but troubled Shallan strives along a parallel path. Despite being broken in ways she refuses to acknowledge, she bears a terrible burden: to somehow prevent the return of the legendary Voidbringers and the civilization-ending Desolation that will follow. The secrets she needs can be found at the Shattered Plains, but just arriving there proves more difficult than she could have imagined.\n\nMeanwhile, at the heart of the Shattered Plains, the Parshendi are making an epochal decision. Hard pressed by years of Alethi attacks, their numbers ever shrinking, they are convinced by their war leader, Eshonai, to risk everything on a desperate gamble with the very supernatural forces they once fled. The possible consequences for Parshendi and humans alike, indeed, for Roshar itself, are as dangerous as they are incalculable.",
        "contributions": [
          {
            "author": {
              "name": "Brandon Sanderson"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/30445719/1737442677027974.jpg"
        },
        "rating": 4.713337757133377,
        "ratings_count": 1507,
        "ratings_distribution": [
          {
            "count": 10,
            "rating": 2
          },
          {
            "count": 2,
            "rating": 2.5
          },
          {
            "count": 35,
            "rating": 3
          },
          {
            "count": 16,
            "rating": 3.5
          },
          {
            "count": 272,
            "rating": 4
          },
          {
            "count": 62,
            "rating": 4.5
          },
          {
            "count": 1110,
            "rating": 5
          }
        ],
        "reviews_count": 132,
        "release_year": 2012
      },
      {
        "id": 374328,
        "title": "Brave New World",
        "description": " Brave New World is a searching vision of an unequal, technologically-advanced future where humans are genetically bred, socially indoctrinated, and pharmaceutically anesthetized to passively uphold an authoritarian ruling order–all at the cost of our freedom, full humanity, and perhaps also our souls. “A genius [who] who spent his life decrying the onward march of the Machine” (The New Yorker), Huxley was a man of incomparable talents: equally an artist, a spiritual seeker, and one of history’s keenest observers of human nature and civilization. Brave New World, his masterpiece, has enthralled and terrified millions of readers, and retains its urgent relevance to this day as both a warning to be heeded as we head into tomorrow and as thought-provoking, satisfying work of literature. Written in the shadow of the rise of fascism during the 1930s, Brave New World likewise speaks to a 21st-century world dominated by mass-entertainment, technology, medicine and pharmaceuticals, the arts of persuasion, and the hidden influence of elites.",
        "contributions": [
          {
            "author": {
              "name": "Aldous Huxley"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/3299811/3e542fb1d6aed92c0f4e9cd0ac9b2f6892ca97a3.jpeg"
        },
        "rating": 3.8860384805130734,
        "ratings_count": 2027,
        "ratings_distribution": [
          {
            "count": 37,
            "rating": 1
          },
          {
            "count": 2,
            "rating": 1.5
          },
          {
            "count": 121,
            "rating": 2
          },
          {
            "count": 5,
            "rating": 2.5
          },
          {
            "count": 437,
            "rating": 3
          },
          {
            "count": 42,
            "rating": 3.5
          },
          {
            "count": 770,
            "rating": 4
          },
          {
            "count": 41,
            "rating": 4.5
          },
          {
            "count": 572,
            "rating": 5
          }
        ],
        "reviews_count": 124,
        "release_year": 1900
      },
      {
        "id": 374481,
        "title": "Lord of the Flies",
        "description": "\"At the dawn of the next world war, a plane crashes on an uncharted island, stranding a group of schoolboys. At first, with no adult supervision, their freedom is something to celebrate. This far from civilization they can do anything they want. Anything. But as order collapses, as strange howls echo in the night, as terror begins its reign, the hope of adventure seems as far removed from reality as the hope of being rescued.\"-- Provided by Amazon",
        "contributions": [
          {
            "author": {
              "name": "William Golding"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/5311461/6685526815468095-8016155.jpg"
        },
        "rating": 3.5659124446630597,
        "ratings_count": 2033,
        "ratings_distribution": [
          {
            "count": 4,
            "rating": 0.5
          },
          {
            "count": 83,
            "rating": 1
          },
          {
            "count": 2,
            "rating": 1.5
          },
          {
            "count": 209,
            "rating": 2
          },
          {
            "count": 7,
            "rating": 2.5
          },
          {
            "count": 582,
            "rating": 3
          },
          {
            "count": 32,
            "rating": 3.5
          },
          {
            "count": 693,
            "rating": 4
          },
          {
            "count": 18,
            "rating": 4.5
          },
          {
            "count": 403,
            "rating": 5
          }
        ],
        "reviews_count": 99,
        "release_year": 1954
      },
      {
        "id": 375634,
        "title": "Sapiens: A Brief History of Humankind",
        "description": "From a renowned historian comes a groundbreaking narrative of humanity’s creation and evolution—a #1 international bestseller—that explores the ways in which biology and history have defined us and enhanced our understanding of what it means to be “human.” \nOne hundred thousand years ago, at least six different species of humans inhabited Earth. Yet today there is only one—homo sapiens. What happened to the others? And what may happen to us? Most books about the history of humanity pursue either a historical or a biological approach, but Dr. Yuval Noah Harari breaks the mold with this highly original book that begins about 70,000 years ago with the appearance of modern cognition. \nFrom examining the role evolving humans have played in the global ecosystem to charting the rise of empires, Sapiens integrates history and science to reconsider accepted narratives, connect past developments with contemporary concerns, and examine specific events within the context of larger ideas. \nDr. Harari also compels us to look ahead, because over the last few decades humans have begun to bend laws of natural selection that have governed life for the past four billion years. We are acquiring the ability to design not only the world around us, but also ourselves. Where is this leading us, and what do we want to become? \nFeaturing 27 photographs, 6 maps, and 25 illustrations/diagrams, this provocative and insightful work is sure to spark debate and is essential reading for aficionados of Jared Diamond, James Gleick, Matt Ridley, Robert Wright, and Sharon Moalem.",
        "contributions": [
          {
            "author": {
              "name": "Yuval Noah Harari"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/external_data/47475626/33e7e46f487646dbf8bcb1a2f7cfa1cc5ac5f07b.jpeg"
        },
        "rating": 4.198630136986301,
        "ratings_count": 1168,
        "ratings_distribution": [
          {
            "count": 10,
            "rating": 1
          },
          {
            "count": 46,
            "rating": 2
          },
          {
            "count": 3,
            "rating": 2.5
          },
          {
            "count": 154,
            "rating": 3
          },
          {
            "count": 15,
            "rating": 3.5
          },
          {
            "count": 407,
            "rating": 4
          },
          {
            "count": 26,
            "rating": 4.5
          },
          {
            "count": 507,
            "rating": 5
          }
        ],
        "reviews_count": 119,
        "release_year": 2011
      },
      {
        "id": 375938,
        "title": "Fahrenheit 451",
        "description": "Guy Montag is a fireman. His job is to burn books, which are forbidden, being the source of all discord and unhappiness. Even so, Montag is unhappy; there is discord in his marriage. Are books hidden in his house? The Mechanical Hound of the Fire Department, armed with a lethal hypodermic, escorted by helicopters, is ready to track down those dissidents who defy society to preserve and read books.\n\nThe classic dystopian novel of a post-literate future, Fahrenheit 451 stands alongside Orwell’s 1984 and Huxley’s Brave New World as a prophetic account of Western civilization’s enslavement by the media, drugs and conformity.\n\nBradbury’s powerful and poetic prose combines with uncanny insight into the potential of technology to create a novel which, decades on from first publication, still has the power to dazzle and shock.",
        "contributions": [
          {
            "author": {
              "name": "Ray Bradbury"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/6336191/3d353406f14fd36043a8bdfb8c3288f90ee4f96c.jpeg"
        },
        "rating": 3.9,
        "ratings_count": 2595,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 42,
            "rating": 1
          },
          {
            "count": 4,
            "rating": 1.5
          },
          {
            "count": 157,
            "rating": 2
          },
          {
            "count": 14,
            "rating": 2.5
          },
          {
            "count": 516,
            "rating": 3
          },
          {
            "count": 64,
            "rating": 3.5
          },
          {
            "count": 1008,
            "rating": 4
          },
          {
            "count": 52,
            "rating": 4.5
          },
          {
            "count": 737,
            "rating": 5
          }
        ],
        "reviews_count": 162,
        "release_year": 1953
      },
      {
        "id": 376219,
        "title": "Harry Potter and the Prisoner of Azkaban",
        "description": "For twelve long years, the dread fortress of Azkaban held an infamous prisoner named Sirius Black. Convicted of killing thirteen people with a single curse, he was said to be the heir apparent to the Dark Lord, Voldemort.\n\nNow he has escaped, leaving only two clues as to where he might be headed: Harry Potter's defeat of You-Know-Who was Black's downfall as well. And the Azkaban guards heard Black muttering in his sleep, \"He's at Hogwarts . . . he's at Hogwarts.\"\n\nHarry Potter isn't safe, not even within the walls of his magical school, surrounded by his friends. Because on top of it all, there may well be a traitor in their midst.",
        "contributions": [
          {
            "author": {
              "name": "J. K. Rowling"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/29858357/2484661554595800.jpg"
        },
        "rating": 4.41696065128901,
        "ratings_count": 3686,
        "ratings_distribution": [
          {
            "count": 7,
            "rating": 0.5
          },
          {
            "count": 18,
            "rating": 1
          },
          {
            "count": 49,
            "rating": 2
          },
          {
            "count": 4,
            "rating": 2.5
          },
          {
            "count": 328,
            "rating": 3
          },
          {
            "count": 42,
            "rating": 3.5
          },
          {
            "count": 1127,
            "rating": 4
          },
          {
            "count": 84,
            "rating": 4.5
          },
          {
            "count": 2027,
            "rating": 5
          }
        ],
        "reviews_count": 117,
        "release_year": 1998
      },
      {
        "id": 377011,
        "title": "A Feast for Crows",
        "description": "The fourth book in \"New York Times\" bestselling author Martins landmark series arrives to the delight of fans the world over. This is historical fiction that never was, filled with gritty characters, realistic conflicts, heroism, barbarism, defeats, and triumphs.",
        "contributions": [
          {
            "author": {
              "name": "George R.R. Martin"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/31409255/86d3e8c97dfc68a8051629c820ada13d84f42158.jpeg"
        },
        "rating": 4.04364471669219,
        "ratings_count": 1306,
        "ratings_distribution": [
          {
            "count": 8,
            "rating": 1
          },
          {
            "count": 46,
            "rating": 2
          },
          {
            "count": 3,
            "rating": 2.5
          },
          {
            "count": 242,
            "rating": 3
          },
          {
            "count": 13,
            "rating": 3.5
          },
          {
            "count": 559,
            "rating": 4
          },
          {
            "count": 18,
            "rating": 4.5
          },
          {
            "count": 417,
            "rating": 5
          }
        ],
        "reviews_count": 64,
        "release_year": 2005
      },
      {
        "id": 377193,
        "title": "The Great Gatsby",
        "description": "The Great Gatsby, F. Scott Fitzgerald’s third book, stands as the supreme achievement of his career. First published in 1925, this quintessential novel of the Jazz Age has been acclaimed by generations of readers.\n\nThe story of the mysteriously wealthy Jay Gatsby and his love for the beautiful Daisy Buchanan, of lavish parties on Long Island at a time when The New York Times noted “gin was the national drink and sex the national obsession,” it is an exquisitely crafted tale of America in the 1920s.",
        "contributions": [
          {
            "author": {
              "name": "F. Scott Fitzgerald"
            }
          },
          {
            "author": {
              "name": "Tony Tanner"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/17138983/8088eb78887206b4259f0b03b5e1c393782f3f65.jpeg"
        },
        "rating": 3.7162691349234604,
        "ratings_count": 2809,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 75,
            "rating": 1
          },
          {
            "count": 8,
            "rating": 1.5
          },
          {
            "count": 232,
            "rating": 2
          },
          {
            "count": 19,
            "rating": 2.5
          },
          {
            "count": 731,
            "rating": 3
          },
          {
            "count": 52,
            "rating": 3.5
          },
          {
            "count": 969,
            "rating": 4
          },
          {
            "count": 42,
            "rating": 4.5
          },
          {
            "count": 680,
            "rating": 5
          }
        ],
        "reviews_count": 186,
        "release_year": 1920
      },
      {
        "id": 377799,
        "title": "The Handmaid's Tale",
        "description": "In Margaret Atwood’s dystopian future, environmental disasters and declining birthrates have led to a Second American Civil War. The result is the rise of the Republic of Gilead, a totalitarian regime that enforces rigid social roles and enslaves the few remaining fertile women. Offred is one of these, a Handmaid bound to produce children for one of Gilead’s commanders. Deprived of her husband, her child, her freedom, and even her own name, Offred clings to her memories and her will to survive. At once a scathing satire, an ominous warning, and a tour de force of narrative suspense, The Handmaid’s Tale is a modern classic.",
        "contributions": [
          {
            "author": {
              "name": "Margaret Atwood"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/external_data/60350995/067edb0a584fce8c8e4aa3bcbf7449249f5630e1.jpeg"
        },
        "rating": 4.097762386787426,
        "ratings_count": 1877,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 23,
            "rating": 1
          },
          {
            "count": 70,
            "rating": 2
          },
          {
            "count": 7,
            "rating": 2.5
          },
          {
            "count": 300,
            "rating": 3
          },
          {
            "count": 27,
            "rating": 3.5
          },
          {
            "count": 701,
            "rating": 4
          },
          {
            "count": 56,
            "rating": 4.5
          },
          {
            "count": 692,
            "rating": 5
          }
        ],
        "reviews_count": 176,
        "release_year": 1985
      },
      {
        "id": 378949,
        "title": "Of Mice and Men",
        "description": "The tragic story of George and Lennie, who move from one farm to another, looking for work. George is clever but Lennie's size and slowness is always getting him into trouble. One day the two men get a job on a farm. Things are going well until they meet Curley, the farm foreman and his unhappy wife. ",
        "contributions": [
          {
            "author": {
              "name": "John Steinbeck"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/30399637/208697025088793-Of_Mice_and_Men_(1937_1st_ed_dust_jacket).jpg"
        },
        "rating": 3.8067846607669615,
        "ratings_count": 1695,
        "ratings_distribution": [
          {
            "count": 44,
            "rating": 1
          },
          {
            "count": 1,
            "rating": 1.5
          },
          {
            "count": 117,
            "rating": 2
          },
          {
            "count": 2,
            "rating": 2.5
          },
          {
            "count": 362,
            "rating": 3
          },
          {
            "count": 46,
            "rating": 3.5
          },
          {
            "count": 682,
            "rating": 4
          },
          {
            "count": 24,
            "rating": 4.5
          },
          {
            "count": 417,
            "rating": 5
          }
        ],
        "reviews_count": 92,
        "release_year": 1937
      },
      {
        "id": 379217,
        "title": "The Name of the Wind",
        "description": "Told in Kvothe's own voice, this is the tale of the magically gifted young man who grows to be the most notorious wizard his world has ever seen.\r\n\r\nThe intimate narrative of his childhood in a troupe of traveling players, his years spent as a near-feral orphan in a crime-ridden city, his daringly brazen yet successful bid to enter a legendary school of magic, and his life as a fugitive after the murder of a king form a gripping coming-of-age story unrivaled in recent literature.\r\n\r\nA high-action story written with a poet's hand, The Name of the Wind is a masterpiece that will transport readers into the body and mind of a wizard.",
        "contributions": [
          {
            "author": {
              "name": "Patrick Rothfuss"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/19454574/9509867934646082.jpg"
        },
        "rating": 4.420528017241379,
        "ratings_count": 1856,
        "ratings_distribution": [
          {
            "count": 27,
            "rating": 1
          },
          {
            "count": 1,
            "rating": 1.5
          },
          {
            "count": 58,
            "rating": 2
          },
          {
            "count": 134,
            "rating": 3
          },
          {
            "count": 18,
            "rating": 3.5
          },
          {
            "count": 463,
            "rating": 4
          },
          {
            "count": 64,
            "rating": 4.5
          },
          {
            "count": 1091,
            "rating": 5
          }
        ],
        "reviews_count": 164,
        "release_year": 2007
      },
      {
        "id": 379631,
        "title": "The Two Towers",
        "description": "Frodo and the Companions of the Ring have been beset by danger during their quest to prevent the Ruling Ring from falling into the hands of the Dark Lord by destroying it in the Cracks of Doom. They have lost the wizard, Gandalf, in the battle with an evil spirit in the Mines of Moria; and at the Falls of Rauros, Boromir, seduced by the power of the Ring, tried to seize it by force. While Frodo and Sam made their escape the rest of the company were attacked by Orcs. Now they continue their journey alone down the great River Anduin – alone, that is, save for the mysterious creeping figure that follows wherever they go. J.R.R. Tolkien’s great work of imaginative fiction has been labelled both a heroic romance and a classic fantasy fiction. By turns comic and homely, epic and diabolic, the narrative moves through countless changes of scene and character in an imaginary world which is totally convincing in its detail.\r\n\r\n----------\r\n**Also contained in:**\r\n\r\n - [The Lord of the Rings][1]\r\n\r\n\r\n  [1]: https://openlibrary.org/works/OL27448W/The_Lord_of_the_Rings",
        "contributions": [
          {
            "author": {
              "name": "J.R.R. Tolkien"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/25616931/cd5d5770785ed7174f4649b06ff4feb6cbdb800e.jpeg"
        },
        "rating": 4.444744744744745,
        "ratings_count": 1665,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 5,
            "rating": 1
          },
          {
            "count": 29,
            "rating": 2
          },
          {
            "count": 1,
            "rating": 2.5
          },
          {
            "count": 140,
            "rating": 3
          },
          {
            "count": 15,
            "rating": 3.5
          },
          {
            "count": 480,
            "rating": 4
          },
          {
            "count": 56,
            "rating": 4.5
          },
          {
            "count": 938,
            "rating": 5
          }
        ],
        "reviews_count": 48,
        "release_year": 1954
      },
      {
        "id": 379647,
        "title": "Pride and Prejudice",
        "description": "Love is in the air when five sisters discover that a wealthy and eligible bachelor is suddenly within reach. But it is his friend, the haughty Mr. Darcy, who becomes smitten. Unfortunately for him, the object of his affection is not so easily swayed.\n\nOne of the most popular characters in English literature, Elizabeth Bennet is intelligent, witty, well-spoken and ahead of her time. If the terrible rumors about Mr. Darcy are true, he doesn’t stand a chance. Yet not all gossip is to be believed when marriage, money, and reputations are on the line. Will Elizabeth and Mr. Darcy circumvent her haste, his ego, and society’s expectations to find love?\n\nWritten more than two centuries ago, Jane Austen’s enduring story of manners, family, and love continues to delight new generations of readers.",
        "contributions": [
          {
            "author": {
              "name": "Jane Austen"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/17099953/d652482fbc1a73c5df99b64160910c99fafa2b94.jpeg"
        },
        "rating": 4.167741935483871,
        "ratings_count": 1860,
        "ratings_distribution": [
          {
            "count": 40,
            "rating": 1
          },
          {
            "count": 2,
            "rating": 1.5
          },
          {
            "count": 79,
            "rating": 2
          },
          {
            "count": 7,
            "rating": 2.5
          },
          {
            "count": 260,
            "rating": 3
          },
          {
            "count": 27,
            "rating": 3.5
          },
          {
            "count": 542,
            "rating": 4
          },
          {
            "count": 48,
            "rating": 4.5
          },
          {
            "count": 855,
            "rating": 5
          }
        ],
        "reviews_count": 139,
        "release_year": 1811
      },
      {
        "id": 379760,
        "title": "1984",
        "description": "Winston Smith toes the Party line, rewriting history to satisfy the demands of the Ministry of Truth. With each lie he writes, Winston grows to hate the Party that seeks power for its own sake and persecutes those who dare to commit thoughtcrimes. But as he starts to think for himself, Winston can’t escape the fact that Big Brother is always watching...\n\nA startling and haunting novel, 1984 creates an imaginary world that is completely convincing from start to finish. No one can deny the novel’s hold on the imaginations of whole generations, or the power of its admonitions—a power that seems to grow, not lessen, with the passage of time.",
        "contributions": [
          {
            "author": {
              "name": "George Orwell"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/external_data/35434356/b1ffbb921e779f0542a441b33fbe504281991e50.jpeg"
        },
        "rating": 4.210495143330964,
        "ratings_count": 4221,
        "ratings_distribution": [
          {
            "count": 2,
            "rating": 0.5
          },
          {
            "count": 32,
            "rating": 1
          },
          {
            "count": 1,
            "rating": 1.5
          },
          {
            "count": 134,
            "rating": 2
          },
          {
            "count": 14,
            "rating": 2.5
          },
          {
            "count": 540,
            "rating": 3
          },
          {
            "count": 117,
            "rating": 3.5
          },
          {
            "count": 1427,
            "rating": 4
          },
          {
            "count": 145,
            "rating": 4.5
          },
          {
            "count": 1809,
            "rating": 5
          }
        ],
        "reviews_count": 273,
        "release_year": 1949
      },
      {
        "id": 381332,
        "title": "The Wise Man's Fear",
        "description": "Preceded by: [The Name of the Wind][1]\r\n\r\nIn The Wise Man's Fear, Kvothe searches for answers, attempting to uncover the truth about the mysterious Amyr, the Chandrian, and the death of his parents. Along the way, Kvothe is put on trial by the legendary Adem mercenaries, forced to reclaim the honor of his family, and travels into the Fae realm. There he meets Felurian, the faerie woman no man can resist, and who no man has ever survived...until Kvothe.\r\n\r\nNow, Kvothe takes his first steps on the path of the hero and learns how difficult life can be when a man becomes a legend in his own time.\r\n\r\n([source][2])\r\n\r\n\r\n  [1]: https://openlibrary.org/works/OL9772092W/The_Name_of_the_Wind\r\n  [2]: https://www.patrickrothfuss.com/content/books.asp",
        "contributions": [
          {
            "author": {
              "name": "Patrick Rothfuss"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/12129615/d30f47b6cccbb010d2fe11e78ee6ecfa10f86740.jpeg"
        },
        "rating": 4.423637759017652,
        "ratings_count": 1303,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 10,
            "rating": 1
          },
          {
            "count": 33,
            "rating": 2
          },
          {
            "count": 1,
            "rating": 2.5
          },
          {
            "count": 104,
            "rating": 3
          },
          {
            "count": 11,
            "rating": 3.5
          },
          {
            "count": 363,
            "rating": 4
          },
          {
            "count": 35,
            "rating": 4.5
          },
          {
            "count": 745,
            "rating": 5
          }
        ],
        "reviews_count": 89,
        "release_year": 24
      },
      {
        "id": 381379,
        "title": "The Catcher in the Rye",
        "description": "The hero-narrator of THE CATCHER IN THE RYE is an ancient child of sixteen, a native New Yorker named Holden Caulfield. Through circumstances that tend to preclude adult, secondhand description, he leaves his prep school in Pennsylvania and goes underground in New York City for three days.\n\nThe boy himself is at once too simple and too complex for us to make any final comment about him or his story. Perhaps the safest thing we can say about Holden is that he was born in the world not just strongly attracted to beauty but, almost, hopelessly impaled on it.\n\nThere are many voices in this novel: children's voices, adult voices, underground voices—but Holden's voice is the most eloquent of all. Transcending his own vernacular, yet remaining marvelously faithful to it, he issues a perfectly articulated cry of mixed pain and pleasure. However, like most lovers and clowns and poets of the higher orders, he keeps most of the pain to, and for, himself. The pleasure he gives away, or sets aside, with all his heart. It is there for the reader who can handle it to keep.",
        "contributions": [
          {
            "author": {
              "name": "J. D. Salinger"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/20025793/2524829738512264-91YXaY-I9VS._SL1500_.jpg"
        },
        "rating": 3.5892116182572615,
        "ratings_count": 2169,
        "ratings_distribution": [
          {
            "count": 3,
            "rating": 0.5
          },
          {
            "count": 125,
            "rating": 1
          },
          {
            "count": 5,
            "rating": 1.5
          },
          {
            "count": 250,
            "rating": 2
          },
          {
            "count": 9,
            "rating": 2.5
          },
          {
            "count": 527,
            "rating": 3
          },
          {
            "count": 44,
            "rating": 3.5
          },
          {
            "count": 621,
            "rating": 4
          },
          {
            "count": 31,
            "rating": 4.5
          },
          {
            "count": 554,
            "rating": 5
          }
        ],
        "reviews_count": 115,
        "release_year": 200
      },
      {
        "id": 381498,
        "title": "Romeo and Juliet",
        "description": "Each edition includes:\r\n\r\n\r\nFreshly edited text based on the best early printed version of the play\r\n\r\nFull explanatory notes conveniently placed on pages facing the text of the play\r\n\r\nScene-by-scene plot summaries\r\n\r\nA key to famous lines and phrases\r\n\r\nAn introduction to reading Shakespeare's language\r\n\r\nAn essay by an outstanding scholar providing a modern perspective on the play\r\n\r\nIllustrations from the Folger Shakespeare Library's vast holdings of rare books\r\n\r\n\r\n\r\nThe Folger Shakespeare Library in Washington, D.C., is home to the world's largest collection of Shakespeare's printed works, and a magnet for Shakespeare scholars from around the globe. In addition to exhibitions open to the public throughout the year, the Folger offers a full calendar of performances and programs.",
        "contributions": [
          {
            "author": {
              "name": "William Shakespeare"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/external_data/27597641/7dd2739e18af9a5a06ec9f4d5fdeec630067c910.jpeg"
        },
        "rating": 3.4975903614457833,
        "ratings_count": 1245,
        "ratings_distribution": [
          {
            "count": 46,
            "rating": 1
          },
          {
            "count": 141,
            "rating": 2
          },
          {
            "count": 5,
            "rating": 2.5
          },
          {
            "count": 407,
            "rating": 3
          },
          {
            "count": 24,
            "rating": 3.5
          },
          {
            "count": 397,
            "rating": 4
          },
          {
            "count": 8,
            "rating": 4.5
          },
          {
            "count": 217,
            "rating": 5
          }
        ],
        "reviews_count": 30,
        "release_year": 1597
      },
      {
        "id": 382143,
        "title": "Harry Potter and the Deathly Hallows",
        "description": "As he climbs into the sidecar of Hagrid’s motorbike and takes to the skies, leaving Privet Drive for the last time, Harry Potter knows that Lord Voldemort and the Death Eaters are not far behind. The protective charm that has kept Harry safe until now is now broken, but he cannot keep hiding. The Dark Lord is breathing fear into everything Harry loves, and to stop him Harry will have to find and destroy the remaining Horcruxes. The final battle must begin – Harry must stand and face his enemy.",
        "contributions": [
          {
            "author": {
              "name": "J. K. Rowling"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/14019917/7017379795452299-58613224.jpg"
        },
        "rating": 4.4186046511627906,
        "ratings_count": 3182,
        "ratings_distribution": [
          {
            "count": 4,
            "rating": 0.5
          },
          {
            "count": 25,
            "rating": 1
          },
          {
            "count": 1,
            "rating": 1.5
          },
          {
            "count": 68,
            "rating": 2
          },
          {
            "count": 8,
            "rating": 2.5
          },
          {
            "count": 277,
            "rating": 3
          },
          {
            "count": 32,
            "rating": 3.5
          },
          {
            "count": 871,
            "rating": 4
          },
          {
            "count": 63,
            "rating": 4.5
          },
          {
            "count": 1833,
            "rating": 5
          }
        ],
        "reviews_count": 106,
        "release_year": 2007
      },
      {
        "id": 382700,
        "title": "The Hobbit",
        "description": "Bilbo Baggins is a hobbit who enjoys a comfortable, unambitious life, rarely traveling any farther than his pantry or cellar. But his contentment is disturbed when the wizard Gandalf and a company of dwarves arrive on his doorstep one day to whisk him away on an adventure. They have launched a plot to raid the treasure hoard guarded by Smaug the Magnificent, a large and very dangerous dragon. Bilbo reluctantly joins their quest, unaware that on his journey to the Lonely Mountain he will encounter both a magic ring and a frightening creature known as Gollum.",
        "contributions": [
          {
            "author": {
              "name": "J.R.R. Tolkien"
            }
          },
          {
            "author": {
              "name": "Christopher Tolkien"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/8548995/27d187cb1a0bec4b21ebfc53658388bc8b071256.jpeg"
        },
        "rating": 4.288701190805871,
        "ratings_count": 3611,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 25,
            "rating": 1
          },
          {
            "count": 88,
            "rating": 2
          },
          {
            "count": 8,
            "rating": 2.5
          },
          {
            "count": 430,
            "rating": 3
          },
          {
            "count": 56,
            "rating": 3.5
          },
          {
            "count": 1187,
            "rating": 4
          },
          {
            "count": 98,
            "rating": 4.5
          },
          {
            "count": 1718,
            "rating": 5
          }
        ],
        "reviews_count": 160,
        "release_year": 1937
      },
      {
        "id": 383236,
        "title": "Harry Potter and the Goblet of Fire",
        "description": "Harry Potter is midway through his training as a wizard and his coming of age. Harry wants to get away from the pernicious Dursleys and go to the International Quidditch Cup. He wants to find out about the mysterious event that's supposed to take place at Hogwarts this year, an event involving two other rival schools of magic, and a competition that hasn't happened for a hundred years. He wants to be a normal, fourteen-year-old wizard. But unfortunately for Harry Potter, he's not normal - even by wizarding standards. And in his case, different can be deadly.\n\nPaperback edition of the fourth Harry Potter novel.",
        "contributions": [
          {
            "author": {
              "name": "J. K. Rowling"
            }
          },
          {
            "author": {
              "name": "Mary GrandPré"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/16055859/5358972612351229-49130.jpg"
        },
        "rating": 4.361594202898551,
        "ratings_count": 3450,
        "ratings_distribution": [
          {
            "count": 5,
            "rating": 0.5
          },
          {
            "count": 20,
            "rating": 1
          },
          {
            "count": 58,
            "rating": 2
          },
          {
            "count": 8,
            "rating": 2.5
          },
          {
            "count": 361,
            "rating": 3
          },
          {
            "count": 45,
            "rating": 3.5
          },
          {
            "count": 1078,
            "rating": 4
          },
          {
            "count": 77,
            "rating": 4.5
          },
          {
            "count": 1798,
            "rating": 5
          }
        ],
        "reviews_count": 111,
        "release_year": 2000
      },
      {
        "id": 383598,
        "title": "Circe",
        "description": "\"Circe\" by Madeline Miller is a mesmerizing reimagining of the Greek mythological character, Circe. Banished to a remote island for defying the gods, Circe's journey unfolds through enchanting prose as she discovers her own power and identity. With vivid storytelling and encounters with legendary figures, including Odysseus, the novel explores themes of strength, transformation, and belonging. \"Circe\" is a captivating blend of mythology and human emotion that offers an unforgettable reading experience.",
        "contributions": [
          {
            "author": {
              "name": "Madeline Miller"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/187333/9694237244087422-circe.jpg"
        },
        "rating": 4.2405228758169935,
        "ratings_count": 1530,
        "ratings_distribution": [
          {
            "count": 18,
            "rating": 1
          },
          {
            "count": 1,
            "rating": 1.5
          },
          {
            "count": 32,
            "rating": 2
          },
          {
            "count": 7,
            "rating": 2.5
          },
          {
            "count": 163,
            "rating": 3
          },
          {
            "count": 37,
            "rating": 3.5
          },
          {
            "count": 561,
            "rating": 4
          },
          {
            "count": 61,
            "rating": 4.5
          },
          {
            "count": 650,
            "rating": 5
          }
        ],
        "reviews_count": 238,
        "release_year": 2018
      },
      {
        "id": 386446,
        "title": "The Way of Kings",
        "description": "From #1 New York Times bestselling author Brandon Sanderson, The Way of Kings, book one of The Stormlight Archive begins an incredible new saga of epic proportion.\n\nRoshar is a world of stone and storms. Uncanny tempests of incredible power sweep across the rocky terrain so frequently that they have shaped ecology and civilization alike. Animals hide in shells, trees pull in branches, and grass retracts into the soilless ground. Cities are built only where the topography offers shelter.\n\nIt has been centuries since the fall of the ten consecrated orders known as the Knights Radiant, but their Shardblades and Shardplate remain: mystical swords and suits of armor that transform ordinary men into near-invincible warriors. Men trade kingdoms for Shardblades. Wars were fought for them, and won by them.\n\nOne such war rages on a ruined landscape called the Shattered Plains. There, Kaladin, who traded his medical apprenticeship for a spear to protect his little brother, has been reduced to slavery. In a war that makes no sense, where ten armies fight separately against a single foe, he struggles to save his men and to fathom the leaders who consider them expendable.\n\nBrightlord Dalinar Kholin commands one of those other armies. Like his brother, the late king, he is fascinated by an ancient text called The Way of Kings. Troubled by over-powering visions of ancient times and the Knights Radiant, he has begun to doubt his own sanity.\n\nAcross the ocean, an untried young woman named Shallan seeks to train under an eminent scholar and notorious heretic, Dalinar's niece, Jasnah. Though she genuinely loves learning, Shallan's motives are less than pure. As she plans a daring theft, her research for Jasnah hints at secrets of the Knights Radiant and the true cause of the war.\n\nThe result of over ten years of planning, writing, and world-building, The Way of Kings is but the opening movement of the Stormlight Archive, a bold masterpiece in the making.\n\nSpeak again the ancient oaths:\n\nLife before death.\nStrength before weakness.\nJourney before Destination.\n\nand return to men the Shards they once bore.\n\nThe Knights Radiant must stand again.",
        "contributions": [
          {
            "author": {
              "name": "Brandon Sanderson"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/3134360/a18d937805a28e3214a556442c8d33f41c02f2cb.jpeg"
        },
        "rating": 4.625609095831077,
        "ratings_count": 1847,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 6,
            "rating": 1
          },
          {
            "count": 18,
            "rating": 2
          },
          {
            "count": 1,
            "rating": 2.5
          },
          {
            "count": 81,
            "rating": 3
          },
          {
            "count": 16,
            "rating": 3.5
          },
          {
            "count": 372,
            "rating": 4
          },
          {
            "count": 97,
            "rating": 4.5
          },
          {
            "count": 1255,
            "rating": 5
          }
        ],
        "reviews_count": 199,
        "release_year": 2010
      },
      {
        "id": 427374,
        "title": "A Clash of Kings",
        "description": "A comet the color of blood and flame cuts across the sky. And from the ancient citadel of Dragonstone to the forbidding shores of Winterfell, chaos reigns. Six factions struggle for control of a divided land and the Iron Throne of the Seven Kingdoms, preparing to stake their claims through tempest, turmoil, and war. It is a tale in which brother plots against brother and the dead rise to walk in the night. Here a princess masquerades as an orphan boy; a knight of the mind prepares a poison for a treacherous sorceress; and wild men descend from the Mountains of the Moon to ravage the countryside. Against a backdrop of incest and fratricide, alchemy and murder, victory may go to the men and women possessed of the coldest steel . . . and the coldest hearts. For when kings clash, the whole land trembles.",
        "contributions": [
          {
            "author": {
              "name": "George R.R. Martin"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/30625294/aa191a358e8c71ccbe9d19c7289d8b16c41c928f.jpeg"
        },
        "rating": 4.337746305418719,
        "ratings_count": 1624,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 7,
            "rating": 1
          },
          {
            "count": 28,
            "rating": 2
          },
          {
            "count": 156,
            "rating": 3
          },
          {
            "count": 12,
            "rating": 3.5
          },
          {
            "count": 612,
            "rating": 4
          },
          {
            "count": 34,
            "rating": 4.5
          },
          {
            "count": 774,
            "rating": 5
          }
        ],
        "reviews_count": 70,
        "release_year": 1998
      },
      {
        "id": 427383,
        "title": "The Well of Ascension",
        "description": "From #1 New York Times bestselling author Brandon Sanderson, the Mistborn series is a heist story of political intrigue and magical, martial-arts action. The impossible has been accomplished. \n\nThe Lord Ruler -- the man who claimed to be god incarnate and brutally ruled the world for a thousand years -- has been vanquished. \n\nBut Kelsier, the hero who masterminded that triumph, is dead too, and now the awesome task of building a new world has been left to his young protégé, Vin, the former street urchin who is now the most powerful Mistborn in the land, and to the idealistic young nobleman she loves. As Kelsier's protégé and slayer of the Lord Ruler she is now venerated by a budding new religion, a distinction that makes her intensely uncomfortable. \n\nEven more worrying, the mists have begun behaving strangely since the Lord Ruler died, and seem to harbor a strange vaporous entity that haunts her. Stopping assassins may keep Vin's Mistborn skills sharp, but it's the least of her problems. Luthadel, the largest city of the former empire, doesn't run itself, and Vin and the other members of Kelsier's crew, who lead the revolution, must learn a whole new set of practical and political skills to help. \n\nIt certainly won't get easier with three armies – one of them composed of ferocious giants – now vying to conquer the city, and no sign of the Lord Ruler's hidden cache of atium, the rarest and most powerful allomantic metal. As the siege of Luthadel tightens, an ancient legend seems to offer a glimmer of hope. But even if it really exists, no one knows where to find the Well of Ascension or what manner of power it bestows. ",
        "contributions": [
          {
            "author": {
              "name": "Brandon Sanderson"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/30432880/4976353406733212.jpg"
        },
        "rating": 4.335126412049489,
        "ratings_count": 1859,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 6,
            "rating": 1
          },
          {
            "count": 21,
            "rating": 2
          },
          {
            "count": 2,
            "rating": 2.5
          },
          {
            "count": 177,
            "rating": 3
          },
          {
            "count": 34,
            "rating": 3.5
          },
          {
            "count": 688,
            "rating": 4
          },
          {
            "count": 93,
            "rating": 4.5
          },
          {
            "count": 837,
            "rating": 5
          }
        ],
        "reviews_count": 167,
        "release_year": 20
      },
      {
        "id": 427473,
        "title": "Red Rising",
        "description": "“I live for the dream that my children will be born free,” she says. “That they will be what they like. That they will own the land their father gave them.”\n“I live for you,” I say sadly.\nEo kisses my cheek. “Then you must live for more.”\n\nDarrow is a Red, a member of the lowest caste in the color-coded society of the future. Like his fellow Reds, he works all day, believing that he and his people are making the surface of Mars livable for future generations. Yet he toils willingly, trusting that his blood and sweat will one day result in a better world for his children.\n\nBut Darrow and his kind have been betrayed. Soon he discovers that humanity reached the surface generations ago. Vast cities and lush wilds spread across the planet. Darrow—and Reds like him—are nothing more than slaves to a decadent ruling class.\n\nInspired by a longing for justice, and driven by the memory of lost love, Darrow sacrifices everything to infiltrate the legendary Institute, a proving ground for the dominant Gold caste, where the next generation of humanity’s overlords struggle for power.  He will be forced to compete for his life and the very future of civilization against the best and most brutal of Society’s ruling class. There, he will stop at nothing to bring down his enemies . . . even if it means he has to become one of them to do so.",
        "contributions": [
          {
            "author": {
              "name": "Pierce Brown"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/26096001/3897005112280259.jpg"
        },
        "rating": 4.137475214805023,
        "ratings_count": 1513,
        "ratings_distribution": [
          {
            "count": 23,
            "rating": 1
          },
          {
            "count": 3,
            "rating": 1.5
          },
          {
            "count": 50,
            "rating": 2
          },
          {
            "count": 11,
            "rating": 2.5
          },
          {
            "count": 186,
            "rating": 3
          },
          {
            "count": 46,
            "rating": 3.5
          },
          {
            "count": 542,
            "rating": 4
          },
          {
            "count": 84,
            "rating": 4.5
          },
          {
            "count": 568,
            "rating": 5
          }
        ],
        "reviews_count": 183,
        "release_year": 2014
      },
      {
        "id": 427524,
        "title": "The Invisible Life of Addie LaRue",
        "description": "France, 1714: in a moment of desperation, a young woman makes a Faustian bargain to live forever—and is cursed to be forgotten by everyone she meets.\n\nThus begins the extraordinary life of Addie LaRue, and a dazzling adventure that will play out across centuries and continents, across history and art, as a young woman learns how far she will go to leave her mark on the world.\n\nBut everything changes when, after nearly 300 years, Addie stumbles across a young man in a hidden bookstore and he remembers her name.",
        "contributions": [
          {
            "author": {
              "name": "V. E. Schwab"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/9887800/25a0234922dc176711a9f418e70af29bc5a6153c.jpeg"
        },
        "rating": 4.110806577916993,
        "ratings_count": 1277,
        "ratings_distribution": [
          {
            "count": 18,
            "rating": 1
          },
          {
            "count": 2,
            "rating": 1.5
          },
          {
            "count": 64,
            "rating": 2
          },
          {
            "count": 4,
            "rating": 2.5
          },
          {
            "count": 200,
            "rating": 3
          },
          {
            "count": 29,
            "rating": 3.5
          },
          {
            "count": 391,
            "rating": 4
          },
          {
            "count": 40,
            "rating": 4.5
          },
          {
            "count": 529,
            "rating": 5
          }
        ],
        "reviews_count": 237,
        "release_year": 2020
      },
      {
        "id": 427537,
        "title": "Artificial Condition",
        "description": "It has a dark past -- one in which a number of humans were killed. A past that caused it to christen itself \"Murderbot.\"\n\nBut it has only vague memories of the massacre that spawned that title, and it wants to know more.\n\nTeaming up with a Research Transport vessel named ART (you don't want to know what the \"A\" stands for), Murderbot heads to the mining facility where it went rogue.\n\nWhat it discovers will forever change the way it thinks...",
        "contributions": [
          {
            "author": {
              "name": "Martha Wells"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/30484660/0142938a-8c5c-4d19-8f45-077442b1d5b4.jpg"
        },
        "rating": 4.1836813611755606,
        "ratings_count": 1293,
        "ratings_distribution": [
          {
            "count": 3,
            "rating": 1
          },
          {
            "count": 1,
            "rating": 1.5
          },
          {
            "count": 12,
            "rating": 2
          },
          {
            "count": 2,
            "rating": 2.5
          },
          {
            "count": 168,
            "rating": 3
          },
          {
            "count": 33,
            "rating": 3.5
          },
          {
            "count": 586,
            "rating": 4
          },
          {
            "count": 55,
            "rating": 4.5
          },
          {
            "count": 433,
            "rating": 5
          }
        ],
        "reviews_count": 117,
        "release_year": 2018
      },
      {
        "id": 427578,
        "title": "Project Hail Mary",
        "description": "Ryland Grace is the sole survivor on a desperate, last-chance mission – and if he fails, humanity and the earth itself will perish. Except that right now, he doesn’t know that. He can’t even remember his own name, let alone the nature of his assignment or how to complete it. All he knows is that he’s been asleep for a very, very long time. And he’s just been awakened to find himself millions of miles from home, with nothing but two corpses for company.\n\nHis crewmates dead, his memories fuzzily returning, he realizes that an impossible task now confronts him. Alone on this tiny ship that’s been cobbled together by every government and space agency on the planet and hurled into the depths of space, it’s up to him to conquer an extinction-level threat to our species.\n\nAnd thanks to an unexpected ally, he just might have a chance.\n\nPart scientific mystery, part dazzling interstellar journey, Project Hail Mary is a tale of discovery, speculation, and survival to rival The Martian – while taking us to places it never dreamed of going.",
        "contributions": [
          {
            "author": {
              "name": "Andy Weir"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/3274049/8741341047797682-91mYu67RfUL._SL1500_.jpg"
        },
        "rating": 4.457264957264957,
        "ratings_count": 2691,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 7,
            "rating": 1
          },
          {
            "count": 4,
            "rating": 1.5
          },
          {
            "count": 43,
            "rating": 2
          },
          {
            "count": 10,
            "rating": 2.5
          },
          {
            "count": 202,
            "rating": 3
          },
          {
            "count": 61,
            "rating": 3.5
          },
          {
            "count": 676,
            "rating": 4
          },
          {
            "count": 177,
            "rating": 4.5
          },
          {
            "count": 1510,
            "rating": 5
          }
        ],
        "reviews_count": 363,
        "release_year": 2021
      },
      {
        "id": 427621,
        "title": "Leviathan Wakes",
        "description": "From a New York Times bestselling and Hugo award-winning author comes a modern masterwork of science fiction, introducing a captain, his crew, and a detective as they unravel a horrifying solar system wide conspiracy that begins with a single missing girl. Now a Prime Original series. Humanity has colonized the solar system—Mars, the Moon, the Asteroid Belt and beyond—but the stars are still out of our reach. Jim Holden is XO of an ice miner making runs from the rings of Saturn to the mining stations of the Belt. When he and his crew stumble upon a derelict ship, the Scopuli, they find themselves in possession of a secret they never wanted. A secret that someone is willing to kill for—and kill on a scale unfathomable to Jim and his crew. War is brewing in the system unless he can find out who left the ship and why. Detective Miller is looking for a girl. One girl in a system of billions, but her parents have money and money talks. When the trail leads him to the Scopuli and rebel sympathizer Holden, he realizes that this girl may be the key to everything. Holden and Miller must thread the needle between the Earth government, the Outer Planet revolutionaries, and secretive corporations—and the odds are against them. But out in the Belt, the rules are different, and one small ship can change the fate of the universe. \"Interplanetary adventure the way it ought to be written.\" —George R. R. Martin The Expanse Leviathan Wakes Caliban's War Abaddon's Gate Cibola Burn Nemesis Games Babylon's Ashes Persepolis Rising Tiamat's Wrath ​Leviathan Falls Memory's Legion The Expanse Short Fiction Drive The Butcher of Anderson Station Gods of Risk The Churn The Vital Abyss Strange Dogs Auberon The Sins of Our Fathers",
        "contributions": [
          {
            "author": {
              "name": "James S. A. Corey"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/31795264/8326503637087890.jpg"
        },
        "rating": 4.239613180515759,
        "ratings_count": 1396,
        "ratings_distribution": [
          {
            "count": 6,
            "rating": 1
          },
          {
            "count": 24,
            "rating": 2
          },
          {
            "count": 4,
            "rating": 2.5
          },
          {
            "count": 139,
            "rating": 3
          },
          {
            "count": 16,
            "rating": 3.5
          },
          {
            "count": 625,
            "rating": 4
          },
          {
            "count": 57,
            "rating": 4.5
          },
          {
            "count": 525,
            "rating": 5
          }
        ],
        "reviews_count": 155,
        "release_year": 2011
      },
      {
        "id": 427798,
        "title": "The Hitchhiker's Guide to the Galaxy",
        "description": "Seconds before Earth is demolished to make way for a galactic freeway, Arthur Dent is plucked off the planet by his friend Ford Prefect, a researcher for the revised edition of The Hitchhiker’s Guide to the Galaxy who, for the last fifteen years, has been posing as an out-of-work actor.\n\nTogether, this dynamic pair began a journey through space aided by a galaxyful of fellow travelers: Zaphod Beeblebrox—the two-headed, three-armed ex-hippie and totally out-to-lunch president of the galaxy; Trillian (formerly Tricia McMillan), Zaphod’s girlfriend, whom Arthur tried to pick up at a cocktail party once upon a time zone; Marvin, a paranoid, brilliant, and chronically depressed robot; and Veet Voojagig, a former graduate student obsessed with the disappearance of all the ballpoint pens he’s bought over the years.\n\nWhere are these pens? Why are we born? Why do we die? For all the answers, stick your thumb to the stars!",
        "contributions": [
          {
            "author": {
              "name": "Douglas Adams"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/4998878/26e9e386e6b34b5218d85473296c43e4dbef5de5.jpeg"
        },
        "rating": 4.242882249560632,
        "ratings_count": 2845,
        "ratings_distribution": [
          {
            "count": 2,
            "rating": 0.5
          },
          {
            "count": 30,
            "rating": 1
          },
          {
            "count": 95,
            "rating": 2
          },
          {
            "count": 5,
            "rating": 2.5
          },
          {
            "count": 368,
            "rating": 3
          },
          {
            "count": 43,
            "rating": 3.5
          },
          {
            "count": 893,
            "rating": 4
          },
          {
            "count": 68,
            "rating": 4.5
          },
          {
            "count": 1341,
            "rating": 5
          }
        ],
        "reviews_count": 135,
        "release_year": 1979
      },
      {
        "id": 427971,
        "title": "All Systems Red",
        "description": "In a corporate-dominated spacefaring future, planetary missions must be approved and supplied by the Company. Exploratory teams are accompanied by Company-supplied security androids, for their own safety.\n\nBut in a society where contracts are awarded to the lowest bidder, safety isn't a primary concern.\n\nOn a distant planet, a team of scientists are conducting surface tests, shadowed by their Company-supplied 'droid -- a self-aware SecUnit that has hacked its own governor module, and refers to itself (though never out loud) as \"Murderbot.\" Scornful of humans, all it really wants is to be left alone long enough to figure out who it is.\n\nBut when a neighboring mission goes dark, it's up to the scientists and their Murderbot to get to the truth.",
        "contributions": [
          {
            "author": {
              "name": "Martha Wells"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/30399613/495a5b89-af3e-4588-82ca-f8ce6928ab0e-allsystems.jpg"
        },
        "rating": 4.065802348336595,
        "ratings_count": 2044,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 10,
            "rating": 1
          },
          {
            "count": 48,
            "rating": 2
          },
          {
            "count": 19,
            "rating": 2.5
          },
          {
            "count": 295,
            "rating": 3
          },
          {
            "count": 85,
            "rating": 3.5
          },
          {
            "count": 917,
            "rating": 4
          },
          {
            "count": 78,
            "rating": 4.5
          },
          {
            "count": 591,
            "rating": 5
          }
        ],
        "reviews_count": 267,
        "release_year": 2017
      },
      {
        "id": 428018,
        "title": "The Midnight Library",
        "description": "Somewhere out beyond the edge of the universe there is a library that contains an infinite number of books, each one the story of another reality. One tells the story of your life as it is, along with another book for the other life you could have lived if you had made a different choice at any point in your life. While we all wonder how our lives might have been, what if you had the chance to go to the library and see for yourself? Would any of these other lives truly be better?\n\nIn The Midnight Library, Matt Haig's enchanting blockbuster novel, Nora Seed finds herself faced with this decision. Faced with the possibility of changing her life for a new one, following a different career, undoing old breakups, realizing her dreams of becoming a glaciologist; she must search within herself as she travels through the Midnight Library to decide what is truly fulfilling in life, and what makes it worth living in the first place.",
        "contributions": [
          {
            "author": {
              "name": "Matt Haig"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/31581955/5913134396133712.jpg"
        },
        "rating": 3.785135135135135,
        "ratings_count": 1850,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 48,
            "rating": 1
          },
          {
            "count": 8,
            "rating": 1.5
          },
          {
            "count": 133,
            "rating": 2
          },
          {
            "count": 28,
            "rating": 2.5
          },
          {
            "count": 414,
            "rating": 3
          },
          {
            "count": 68,
            "rating": 3.5
          },
          {
            "count": 595,
            "rating": 4
          },
          {
            "count": 58,
            "rating": 4.5
          },
          {
            "count": 497,
            "rating": 5
          }
        ],
        "reviews_count": 320,
        "release_year": 2020
      },
      {
        "id": 428023,
        "title": "Atomic Habits: An Easy and Proven Way to Build Good Habits and Break Bad Ones",
        "description": "No matter your goals, Atomic Habits offers a proven framework for improving—every day. James Clear, one of the world's leading experts on habit formation, reveals practical strategies that will teach you exactly how to form good habits, break bad ones, and master the tiny behaviors that lead to remarkable results.\n\nIf you're having trouble changing your habits, the problem isn't you. The problem is your system. Bad habits repeat themselves again and again not because you don't want to change, but because you have the wrong system for change. You do not rise to the level of your goals. You fall to the level of your systems. Here, you'll get a proven system that can take you to new heights.\n\nClear is known for his ability to distill complex topics into simple behaviors that can be easily applied to daily life and work. Here, he draws on the most proven ideas from biology, psychology, and neuroscience to create an easy-to-understand guide for making good habits inevitable and bad habits impossible. Along the way, readers will be inspired and entertained with true stories from Olympic gold medalists, award-winning artists, business leaders, life-saving physicians, and star comedians who have used the science of small habits to master their craft and vault to the top of their field.\n\nLearn how to:\n- Make time for new habits (even when life gets crazy);\n- Overcome a lack of motivation and willpower;\n- Design your environment to make success easier;\n- Get back on track when you fall off course;\n...and much more.\n\nAtomic Habits will reshape the way you think about progress and success, and give you the tools and strategies you need to transform your habits--whether you are a team looking to win a championship, an organization hoping to redefine an industry, or simply an individual who wishes to quit smoking, lose weight, reduce stress, or achieve any other goal.",
        "contributions": [
          {
            "author": {
              "name": "James Clear"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/30400296/214994214060325.jpg"
        },
        "rating": 4.204173486088379,
        "ratings_count": 1222,
        "ratings_distribution": [
          {
            "count": 5,
            "rating": 1
          },
          {
            "count": 29,
            "rating": 2
          },
          {
            "count": 2,
            "rating": 2.5
          },
          {
            "count": 187,
            "rating": 3
          },
          {
            "count": 31,
            "rating": 3.5
          },
          {
            "count": 419,
            "rating": 4
          },
          {
            "count": 42,
            "rating": 4.5
          },
          {
            "count": 507,
            "rating": 5
          }
        ],
        "reviews_count": 142,
        "release_year": 2016
      },
      {
        "id": 428290,
        "title": "A Court of Thorns and Roses",
        "description": "When nineteen-year-old huntress Feyre kills a wolf in the woods, a beast-like creature arrives to demand retribution. Dragged to a treacherous magical land she only knows about from legends, Feyre discovers that her captor is not truly a beast, but one of the lethal, immortal faeries who once ruled their world.\n\nAs she dwells on his estate, her feelings for the faerie, Tamlin, transform from icy hostility into a fiery passion that burns through every lie and warning she’s been told about the beautiful, dangerous world of the Fae. But an ancient, wicked shadow over the faerie lands is growing, and Feyre must find a way to stop it . . . or doom Tamlin—and his world—forever.",
        "contributions": [
          {
            "author": {
              "name": "Sarah J. Maas"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/external_data/27599647/a7e4c34149071bee70a437d0d9cee1bc56eacf47.jpeg"
        },
        "rating": 3.701744820065431,
        "ratings_count": 1834,
        "ratings_distribution": [
          {
            "count": 7,
            "rating": 0.5
          },
          {
            "count": 54,
            "rating": 1
          },
          {
            "count": 11,
            "rating": 1.5
          },
          {
            "count": 160,
            "rating": 2
          },
          {
            "count": 35,
            "rating": 2.5
          },
          {
            "count": 394,
            "rating": 3
          },
          {
            "count": 81,
            "rating": 3.5
          },
          {
            "count": 585,
            "rating": 4
          },
          {
            "count": 66,
            "rating": 4.5
          },
          {
            "count": 441,
            "rating": 5
          }
        ],
        "reviews_count": 294,
        "release_year": 2014
      },
      {
        "id": 428465,
        "title": "Harry Potter and the Order of the Phoenix",
        "description": "The book that took the world by storm.... In his fifth year at Hogwart's, Harry faces challenges at every turn, from the dark threat of He-Who-Must-Not-Be- Named and the unreliability of the government of the magical world to the rise of Ron Weasley as the keeper of the Gryffindor Quidditch Team. Along the way he learns about the strength of his friends, the fierceness of his enemies, and the meaning of sacrifice.",
        "contributions": [
          {
            "author": {
              "name": "J. K. Rowling"
            }
          },
          {
            "author": {
              "name": "Mary GrandPré"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/29262698/2170450621507933-58613451.jpg"
        },
        "rating": 4.2815699658703075,
        "ratings_count": 3224,
        "ratings_distribution": [
          {
            "count": 6,
            "rating": 0.5
          },
          {
            "count": 24,
            "rating": 1
          },
          {
            "count": 1,
            "rating": 1.5
          },
          {
            "count": 79,
            "rating": 2
          },
          {
            "count": 12,
            "rating": 2.5
          },
          {
            "count": 402,
            "rating": 3
          },
          {
            "count": 56,
            "rating": 3.5
          },
          {
            "count": 1000,
            "rating": 4
          },
          {
            "count": 70,
            "rating": 4.5
          },
          {
            "count": 1574,
            "rating": 5
          }
        ],
        "reviews_count": 97,
        "release_year": 2003
      },
      {
        "id": 428506,
        "title": "Harry Potter and the Half-Blood Prince",
        "description": "The war against Voldemort is not going well; even the Muggles have been affected. Dumbledore is absent from Hogwarts for long stretches of time, and the Order of the Phoenix has already suffered losses.\n\nAnd yet . . . As with all wars, life goes on. Sixth-year students learn to Apparate. Teenagers flirt and fight and fall in love. Harry receives some extraordinary help in Potions from the mysterious Half-Blood Prince. And with Dumbledore's guidance, he seeks out the full, complex story of the boy who became Lord Voldemort -- and thus finds what may be his only vulnerability.",
        "contributions": [
          {
            "author": {
              "name": "J. K. Rowling"
            }
          },
          {
            "author": {
              "name": "Mary GrandPré"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/19724535/8038369521613846-58613345.jpg"
        },
        "rating": 4.36923562855338,
        "ratings_count": 3166,
        "ratings_distribution": [
          {
            "count": 6,
            "rating": 0.5
          },
          {
            "count": 25,
            "rating": 1
          },
          {
            "count": 53,
            "rating": 2
          },
          {
            "count": 9,
            "rating": 2.5
          },
          {
            "count": 313,
            "rating": 3
          },
          {
            "count": 45,
            "rating": 3.5
          },
          {
            "count": 955,
            "rating": 4
          },
          {
            "count": 80,
            "rating": 4.5
          },
          {
            "count": 1680,
            "rating": 5
          }
        ],
        "reviews_count": 91,
        "release_year": 2005
      },
      {
        "id": 428657,
        "title": "Dracula",
        "description": "Acting on behalf of his firm of solicitors, Jonathan Harker travels to the Carpathian Mountains to finalize the sale of England's Carfax Abbey to Transylvanian noble Count Dracula. Little does he realize that, in doing so, he endangers all that he loves. For Dracula is one of the Un-dead—a centuries-old vampire who sleeps by day and stalks by night, feasting on the blood of his helpless victims. Once on English soil, the count sets his sights on Jonathan's circle of associates, among them his beloved wife Mina. To thwart Dracula's evil designs, Jonathan and his friends will have to accept as truth the most preposterous superstitions concerning vampires, and in the company of legendary vampire hunter Abraham Van Helsing, embark on an unholy adventure for which even their worst nightmares have not prepared them.",
        "contributions": [
          {
            "author": {
              "name": "Bram Stoker"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/12963649/989255574897903-812-AV3IC3L._SL1500_.jpg"
        },
        "rating": 3.8661354581673306,
        "ratings_count": 1255,
        "ratings_distribution": [
          {
            "count": 11,
            "rating": 1
          },
          {
            "count": 78,
            "rating": 2
          },
          {
            "count": 6,
            "rating": 2.5
          },
          {
            "count": 296,
            "rating": 3
          },
          {
            "count": 32,
            "rating": 3.5
          },
          {
            "count": 471,
            "rating": 4
          },
          {
            "count": 38,
            "rating": 4.5
          },
          {
            "count": 323,
            "rating": 5
          }
        ],
        "reviews_count": 118,
        "release_year": 1897
      },
      {
        "id": 428929,
        "title": "A Court of Mist and Fury",
        "description": "Feyre has undergone more trials than one human woman can carry in her heart.\n\nThough she’s now been granted the powers and lifespan of the High Fae, she is haunted by her time Under the Mountain and the terrible deeds she performed to save the lives of Tamlin and his people.\n\nAs her marriage to Tamlin approaches, Feyre’s hollowness and nightmares consume her. She finds herself split into two different people: one who upholds her bargain with Rhysand, High Lord of the feared Night Court, and one who lives out her life in the Spring Court with Tamlin.\n\nWhile Feyre navigates a dark web of politics, passion, and dazzling power, a greater evil looms. She might just be the key to stopping it, but only if she can harness her harrowing gifts, heal her fractured soul, and decide how she wishes to shape her future—and the future of a world in turmoil.",
        "contributions": [
          {
            "author": {
              "name": "Sarah J. Maas"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/external_data/50323130/22aae36f178586d62c607f5664f6e918fe08703b.jpeg"
        },
        "rating": 4.353498542274052,
        "ratings_count": 1372,
        "ratings_distribution": [
          {
            "count": 2,
            "rating": 0.5
          },
          {
            "count": 13,
            "rating": 1
          },
          {
            "count": 3,
            "rating": 1.5
          },
          {
            "count": 37,
            "rating": 2
          },
          {
            "count": 11,
            "rating": 2.5
          },
          {
            "count": 119,
            "rating": 3
          },
          {
            "count": 32,
            "rating": 3.5
          },
          {
            "count": 360,
            "rating": 4
          },
          {
            "count": 62,
            "rating": 4.5
          },
          {
            "count": 733,
            "rating": 5
          }
        ],
        "reviews_count": 202,
        "release_year": 2016
      },
      {
        "id": 429306,
        "title": "Harry Potter and the Chamber of Secrets",
        "description": "The Dursleys were so mean and hideous that summer that all Harry Potter wanted was to get back to the Hogwarts School for Witchcraft and Wizardry. But just as he's packing his bags, Harry receives a warning from a strange, impish creature named Dobby who says that if Harry Potter returns to Hogwarts, disaster will strike.\n\nAnd strike it does. For in Harry's second year at Hogwarts, fresh torments and horrors arise, including an outrageously stuck-up new professor, Gilderoy Lockhart, a spirit named Moaning Myrtle who haunts the girls' bathroom, and the unwanted attentions of Ron Weasley's younger sister, Ginny. But each of these seem minor annoyances when the real trouble begins, and someone, or something, starts turning Hogwarts students to stone. Could it be Draco Malfoy, a more poisonous rival than ever? Could it possibly be Hagrid, whose mysterious past is finally told? Or could it be the one everyone at Hogwarts most suspects: Harry Potter himself?",
        "contributions": [
          {
            "author": {
              "name": "J. K. Rowling"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/25614271/4833571895209920-lf.jpeg"
        },
        "rating": 4.16862852450041,
        "ratings_count": 3653,
        "ratings_distribution": [
          {
            "count": 4,
            "rating": 0.5
          },
          {
            "count": 26,
            "rating": 1
          },
          {
            "count": 103,
            "rating": 2
          },
          {
            "count": 19,
            "rating": 2.5
          },
          {
            "count": 581,
            "rating": 3
          },
          {
            "count": 85,
            "rating": 3.5
          },
          {
            "count": 1235,
            "rating": 4
          },
          {
            "count": 68,
            "rating": 4.5
          },
          {
            "count": 1532,
            "rating": 5
          }
        ],
        "reviews_count": 132,
        "release_year": 1998
      },
      {
        "id": 429356,
        "title": "The Lion, the Witch and the Wardrobe",
        "description": "Four adventurous siblings—Peter, Susan, Edmund, and Lucy Pevensie—step through a wardrobe door and into the land of Narnia, a land frozen in eternal winter and enslaved by the power of the White Witch. But when almost all hope is lost, the return of the Great Lion, Aslan, signals a great change . . . and a great sacrifice.\n\nJourney into the land beyond the wardrobe! The Lion, the Witch and the Wardrobe is the second book in C. S. Lewis's classic fantasy series, which has been captivating readers of all ages for over sixty years. This is a stand-alone novel, but if you would like journey back to Narnia, read The Horse and His Boy, the third book in The Chronicles of Narnia.",
        "contributions": [
          {
            "author": {
              "name": "C. S. Lewis"
            }
          },
          {
            "author": {
              "name": "Pauline Baynes"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/9059039/53d204cdf693efc57b97fc554d9750377f3e5c00.jpeg"
        },
        "rating": 3.9516607354685647,
        "ratings_count": 1686,
        "ratings_distribution": [
          {
            "count": 21,
            "rating": 1
          },
          {
            "count": 1,
            "rating": 1.5
          },
          {
            "count": 91,
            "rating": 2
          },
          {
            "count": 5,
            "rating": 2.5
          },
          {
            "count": 361,
            "rating": 3
          },
          {
            "count": 21,
            "rating": 3.5
          },
          {
            "count": 634,
            "rating": 4
          },
          {
            "count": 14,
            "rating": 4.5
          },
          {
            "count": 538,
            "rating": 5
          }
        ],
        "reviews_count": 70,
        "release_year": 1950
      },
      {
        "id": 431713,
        "title": "The Metamorphosis",
        "description": "Franz Kafka’s The Metamorphosis begins with one of the most shocking openings in literature: traveling salesman Gregor Samsa wakes up to discover he has turned into a giant insect. But this is not just a story of absurd metamorphosis—it is a deeply human tale of alienation, family obligation, and what happens when someone is no longer “useful” to society.\n\nAs Gregor’s family struggles to cope with his bizarre condition, Kafka explores powerful themes of dependence, dignity, and the quiet cruelty of social expectations. Both absurd and painfully realistic, this modern classic strikes a unique balance of dark humor and existential insight.\n\nFor fans of George Orwell, Albert Camus, and modernist fiction that blurs the line between the strange and the familiar.\n\nWhether you're reading it for the first time or rediscovering it with fresh eyes, The Metamorphosis is a novella that stays with you—long after you’ve turned the final page.",
        "contributions": [
          {
            "author": {
              "name": "Franz Kafka"
            }
          },
          {
            "author": {
              "name": "David Wyllie"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/external_data/59991877/b720791bd9fa84ef7c087d4531f3bfa3580d3882.jpeg"
        },
        "rating": 3.8151447661469935,
        "ratings_count": 1347,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 22,
            "rating": 1
          },
          {
            "count": 77,
            "rating": 2
          },
          {
            "count": 16,
            "rating": 2.5
          },
          {
            "count": 333,
            "rating": 3
          },
          {
            "count": 35,
            "rating": 3.5
          },
          {
            "count": 494,
            "rating": 4
          },
          {
            "count": 40,
            "rating": 4.5
          },
          {
            "count": 329,
            "rating": 5
          }
        ],
        "reviews_count": 106,
        "release_year": 1915
      },
      {
        "id": 434342,
        "title": "Good Omens: The Nice and Accurate Prophecies of Agnes Nutter, Witch",
        "description": "Armageddon only happens once, you know. They don't let you go around again until you get it right.\r\n\r\nAccording to the Nice and Accurate Prophecies of Agnes Nutter, Witch - the world's only totally reliable guide to the future, written in 1655, before she exploded - the world will end on a Saturday. \r\n\r\nNext Saturday, in fact. Just after tea...\r\n\r\nPeople have been predicting the end of the world almost from its very beginning, so it's only natural to be sceptical when a new date is set for Judgement Day.\r\n\r\nThis time though, the armies of Good and Evil really do appear to be massing. The four Bikers of the Apocalypse are hitting the road. But both the angels and demons - well, one fast-living demon and a somewhat fussy angel - would quite like the Rapture not to happen.\r\n\r\nOh, and someone seems to have misplaced the Antichrist...",
        "contributions": [
          {
            "author": {
              "name": "Neil Gaiman"
            }
          },
          {
            "author": {
              "name": "Terry Pratchett"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/25781438/e82f7695d3fb5f077c3a997a1359c639fdf7f891.jpeg"
        },
        "rating": 4.175150703281982,
        "ratings_count": 1493,
        "ratings_distribution": [
          {
            "count": 13,
            "rating": 1
          },
          {
            "count": 1,
            "rating": 1.5
          },
          {
            "count": 61,
            "rating": 2
          },
          {
            "count": 1,
            "rating": 2.5
          },
          {
            "count": 206,
            "rating": 3
          },
          {
            "count": 23,
            "rating": 3.5
          },
          {
            "count": 527,
            "rating": 4
          },
          {
            "count": 34,
            "rating": 4.5
          },
          {
            "count": 627,
            "rating": 5
          }
        ],
        "reviews_count": 117,
        "release_year": 1990
      },
      {
        "id": 436692,
        "title": "The Picture of Dorian Grey",
        "description": "In this celebrated work Wilde forged a devastating portrait of the effects of evil and debauchery on a young aesthete in late-19th-century England. Combining elements of the Gothic horror novel and decadent French fiction, the book centers on a striking premise: As Dorian Gray sinks into a life of crime and gross sensuality, his body retains perfect youth and vigor while his recently painted portrait grows day by day into a hideous record of evil, which he must keep hidden from the world. ",
        "contributions": [
          {
            "author": {
              "name": "Oscar Wilde"
            }
          },
          {
            "author": {
              "name": "Susan Beattie"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/external_data/59387927/b157de9132c5f657606f923066a4ada42c6dea51.jpeg"
        },
        "rating": 4.046309192200557,
        "ratings_count": 1436,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 16,
            "rating": 1
          },
          {
            "count": 47,
            "rating": 2
          },
          {
            "count": 6,
            "rating": 2.5
          },
          {
            "count": 271,
            "rating": 3
          },
          {
            "count": 27,
            "rating": 3.5
          },
          {
            "count": 540,
            "rating": 4
          },
          {
            "count": 45,
            "rating": 4.5
          },
          {
            "count": 483,
            "rating": 5
          }
        ],
        "reviews_count": 131,
        "release_year": 15
      },
      {
        "id": 436805,
        "title": "The House in the Cerulean Sea",
        "description": "Linus Baker is a by-the-book case worker in the Department in Charge of Magical Youth. He's tasked with determining whether six dangerous magical children are likely to bring about the end of the world.\n\nArthur Parnassus is the master of the orphanage. He would do anything to keep the children safe, even if it means the world will burn. And his secrets will come to light.\n\nThe House in the Cerulean Sea is an enchanting love story, masterfully told, about the profound experience of discovering an unlikely family in an unexpected place―and realizing that family is yours.",
        "contributions": [
          {
            "author": {
              "name": "TJ Klune"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/29272503/10207033-L.jpg"
        },
        "rating": 4.301680672268907,
        "ratings_count": 1190,
        "ratings_distribution": [
          {
            "count": 13,
            "rating": 1
          },
          {
            "count": 33,
            "rating": 2
          },
          {
            "count": 8,
            "rating": 2.5
          },
          {
            "count": 143,
            "rating": 3
          },
          {
            "count": 13,
            "rating": 3.5
          },
          {
            "count": 334,
            "rating": 4
          },
          {
            "count": 41,
            "rating": 4.5
          },
          {
            "count": 605,
            "rating": 5
          }
        ],
        "reviews_count": 246,
        "release_year": 2020
      },
      {
        "id": 463683,
        "title": "Mockingjay",
        "description": "Against all odds, Katniss Everdeen has survived the Hunger Games twice. But now that she's made it out of the bloody arena alive, she's still not safe. The Capitol is angry. The Capitol wants revenge. Who do they think should pay for the unrest? Katniss. And what's worse, President Snow has made it clear that no one else is safe either. Not Katniss's family, not her friends, not the people of District 12. Powerful and haunting, this thrilling final installment of Suzanne Collins's groundbreaking The Hunger Games trilogy promises to be one of the most talked about books of the year.",
        "contributions": [
          {
            "author": {
              "name": "Suzanne Collins"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/book_mappings/7332302/73342f741799f340cc0237284f304ed48b64d1cb.jpeg"
        },
        "rating": 3.798556701030928,
        "ratings_count": 2425,
        "ratings_distribution": [
          {
            "count": 49,
            "rating": 1
          },
          {
            "count": 187,
            "rating": 2
          },
          {
            "count": 8,
            "rating": 2.5
          },
          {
            "count": 598,
            "rating": 3
          },
          {
            "count": 50,
            "rating": 3.5
          },
          {
            "count": 850,
            "rating": 4
          },
          {
            "count": 31,
            "rating": 4.5
          },
          {
            "count": 652,
            "rating": 5
          }
        ],
        "reviews_count": 138,
        "release_year": 2009
      },
      {
        "id": 467600,
        "title": "I'm Glad My Mom Died",
        "description": "Jennette McCurdy was six years old when she had her first acting audition. Her mother’s dream was for her only daughter to become a star, and Jennette would do anything to make her mother happy. So she went along with what Mom called “calorie restriction,” eating little and weighing herself five times a day. She endured extensive at-home makeovers while Mom chided, “Your eyelashes are invisible, okay? You think Dakota Fanning doesn’t tint hers?” She was even showered by Mom until age sixteen while sharing her diaries, email, and all her income.\r\n\r\nIn I’m Glad My Mom Died, Jennette recounts all this in unflinching detail—just as she chronicles what happens when the dream finally comes true. Cast in a new Nickelodeon series called iCarly, she is thrust into fame. Though Mom is ecstatic, emailing fan club moderators and getting on a first-name basis with the paparazzi (“Hi Gale!”), Jennette is riddled with anxiety, shame, and self-loathing, which manifest into eating disorders, addiction, and a series of unhealthy relationships. These issues only get worse when, soon after taking the lead in the iCarly spinoff Sam & Cat alongside Ariana Grande, her mother dies of cancer. Finally, after discovering therapy and quitting acting, Jennette embarks on recovery and decides for the first time in her life what she really wants.\r\n\r\nTold with refreshing candor and dark humor, I’m Glad My Mom Died is an inspiring story of resilience, independence, and the joy of shampooing your own hair.",
        "contributions": [
          {
            "author": {
              "name": "Jennette McCurdy"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/30385435/5248231194722670-59364173.jpg"
        },
        "rating": 4.47293116782676,
        "ratings_count": 1293,
        "ratings_distribution": [
          {
            "count": 2,
            "rating": 1
          },
          {
            "count": 18,
            "rating": 2
          },
          {
            "count": 2,
            "rating": 2.5
          },
          {
            "count": 92,
            "rating": 3
          },
          {
            "count": 15,
            "rating": 3.5
          },
          {
            "count": 366,
            "rating": 4
          },
          {
            "count": 84,
            "rating": 4.5
          },
          {
            "count": 714,
            "rating": 5
          }
        ],
        "reviews_count": 210,
        "release_year": 2022
      },
      {
        "id": 475214,
        "title": "Legends & Lattes",
        "description": "Legends & Lattes is a cosy, heartwarming slice-of-life fantasy about found families and fresh starts - perfect for fans of TJ Klune, Katherine Addison and T. Kingfisher. High fantasy, low stakes - with a double-shot of coffee. After decades of adventuring, Viv the orc barbarian is finally hanging up her sword for good. Now she sets her sights on a new dream - for she plans to open the first coffee shop in the city of Thune. Even though no one there knows what coffee actually is.\n\n If Viv wants to put the past behind her, she can't go it alone. And help might arrive from unexpected quarters. Yet old rivals and new stand in the way of success. And Thune's shady underbelly could make it all too easy for Viv to take up the blade once more. \n\nBut the true reward of the uncharted path is the travellers you meet along the way. Whether bound by ancient magic, delicious pastries or a freshly brewed cup, they may become something deeper than Viv ever could have imagined.\n\n 'This is a warm hug of a book, a place to retreat from the world for a little while, drink a coffee, and come out a little better' - T. Kingfisher, bestselling author of Nettle & Bone",
        "contributions": [
          {
            "author": {
              "name": "Travis Baldree"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/30396420/4372639752917043.jpg"
        },
        "rating": 4.14397046759639,
        "ratings_count": 1219,
        "ratings_distribution": [
          {
            "count": 1,
            "rating": 0.5
          },
          {
            "count": 8,
            "rating": 1
          },
          {
            "count": 23,
            "rating": 2
          },
          {
            "count": 8,
            "rating": 2.5
          },
          {
            "count": 181,
            "rating": 3
          },
          {
            "count": 46,
            "rating": 3.5
          },
          {
            "count": 451,
            "rating": 4
          },
          {
            "count": 72,
            "rating": 4.5
          },
          {
            "count": 429,
            "rating": 5
          }
        ],
        "reviews_count": 200,
        "release_year": 2022
      },
      {
        "id": 479910,
        "title": "Tomorrow, and Tomorrow, and Tomorrow",
        "description": "In this exhilarating novel by the best-selling author of The Storied Life of A. J. Fikry, two friends—often in love, but never lovers—come together as creative partners in the world of video game design, where success brings them fame, joy, tragedy, duplicity, and, ultimately, a kind of immortality.\n\nOn a bitter-cold day, in the December of his junior year at Harvard, Sam Masur exits a subway car and sees, amid the hordes of people waiting on the platform, Sadie Green. He calls her name. For a moment, she pretends she hasn’t heard him, but then, she turns, and a game begins: a legendary collaboration that will launch them to stardom. These friends, intimates since childhood, borrow money, beg favors, and, before even graduating college, they have created their first blockbuster, Ichigo. Overnight, the world is theirs. Not even twenty-five years old, Sam and Sadie are brilliant, successful, and rich, but these qualities won’t protect them from their own creative ambitions or the betrayals of their hearts. Spanning thirty years, from Cambridge, Massachusetts, to Venice Beach, California, and lands in between and far beyond, Gabrielle Zevin’s Tomorrow, and Tomorrow, and Tomorrow is a dazzling and intricately imagined novel that examines the multifarious nature of identity, disability, failure, the redemptive possibilities in play, and above all, our need to connect: to be loved and to love. Yes, it is a love story, but it is not one you have read before.\n\n \"Utterly brilliant. In this sweeping, gorgeously written novel, Gabrielle Zevin charts the beauty, tenacity, and fragility of human love and creativity. Tomorrow, and Tomorrow, and Tomorrow is one of the best books I've ever read.\" —John Green ",
        "contributions": [
          {
            "author": {
              "name": "Gabrielle Zevin"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/30535150/2efdfd508a803c89913fd6e987f69048a17c89c6.jpeg"
        },
        "rating": 4.102169349195242,
        "ratings_count": 1429,
        "ratings_distribution": [
          {
            "count": 2,
            "rating": 0.5
          },
          {
            "count": 20,
            "rating": 1
          },
          {
            "count": 3,
            "rating": 1.5
          },
          {
            "count": 63,
            "rating": 2
          },
          {
            "count": 14,
            "rating": 2.5
          },
          {
            "count": 205,
            "rating": 3
          },
          {
            "count": 45,
            "rating": 3.5
          },
          {
            "count": 441,
            "rating": 4
          },
          {
            "count": 82,
            "rating": 4.5
          },
          {
            "count": 554,
            "rating": 5
          }
        ],
        "reviews_count": 231,
        "release_year": 2022
      },
      {
        "id": 485409,
        "title": "Frankenstein",
        "description": "Obsessed with creating life itself, Victor Frankenstein plunders graveyards for the material to fashion a new being, which he shocks into life with electricity. But his botched creature, rejected by Frankenstein and denied human companionship, sets out to destroy his maker and all that he holds dear. Mary Shelley's chilling Gothic tale was conceived when she was only eighteen, living with her lover Percy Shelley near Byron's villa on Lake Geneva. It would become the world's most famous work of horror fiction, and remains a devastating exploration of the limits of human creativity.",
        "contributions": [
          {
            "author": {
              "name": "Mary Shelley"
            }
          },
          {
            "author": {
              "name": "Percy Bysshe Shelley"
            }
          },
          {
            "author": {
              "name": "Maurice Hindle"
            }
          },
          {
            "author": {
              "name": "John William Polidori"
            }
          },
          {
            "author": {
              "name": "Lord Byron"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/18780509/e353c2cafc8293db69a5771436ffc8a8779c26ab.jpeg"
        },
        "rating": 3.855788096795291,
        "ratings_count": 1529,
        "ratings_distribution": [
          {
            "count": 23,
            "rating": 1
          },
          {
            "count": 1,
            "rating": 1.5
          },
          {
            "count": 95,
            "rating": 2
          },
          {
            "count": 8,
            "rating": 2.5
          },
          {
            "count": 365,
            "rating": 3
          },
          {
            "count": 33,
            "rating": 3.5
          },
          {
            "count": 546,
            "rating": 4
          },
          {
            "count": 47,
            "rating": 4.5
          },
          {
            "count": 411,
            "rating": 5
          }
        ],
        "reviews_count": 139,
        "release_year": -800
      },
      {
        "id": 714600,
        "title": "Fourth Wing",
        "description": "\"Twenty-year-old Violet Sorrengail was supposed to enter the Scribe Quadrant, living a quiet life among books and history. Now, the commanding general―also known as her tough-as-talons mother―has ordered Violet to join the hundreds of candidates striving to become the elite of Navarre: dragon riders.\n\nBut when you’re smaller than everyone else and your body is brittle, death is only a heartbeat away...because dragons don’t bond to “fragile” humans. They incinerate them.\n\nWith fewer dragons willing to bond than cadets, most would kill Violet to better their own chances of success. The rest would kill her just for being her mother’s daughter―like Xaden Riorson, the most powerful and ruthless wingleader in the Riders Quadrant.\n\nShe’ll need every edge her wits can give her just to see the next sunrise.\n\nYet, with every day that passes, the war outside grows more deadly, the kingdom's protective wards are failing, and the death toll continues to rise. Even worse, Violet begins to suspect leadership is hiding a terrible secret.\"-- Provided by Amazon",
        "contributions": [
          {
            "author": {
              "name": "Rebecca Yarros"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/editions/30707731/3559167047761380.jpeg"
        },
        "rating": 3.9705246078961602,
        "ratings_count": 1849,
        "ratings_distribution": [
          {
            "count": 21,
            "rating": 0.5
          },
          {
            "count": 50,
            "rating": 1
          },
          {
            "count": 10,
            "rating": 1.5
          },
          {
            "count": 120,
            "rating": 2
          },
          {
            "count": 29,
            "rating": 2.5
          },
          {
            "count": 242,
            "rating": 3
          },
          {
            "count": 86,
            "rating": 3.5
          },
          {
            "count": 479,
            "rating": 4
          },
          {
            "count": 99,
            "rating": 4.5
          },
          {
            "count": 713,
            "rating": 5
          }
        ],
        "reviews_count": 359,
        "release_year": 2023
      },
      {
        "id": 883865,
        "title": "Frankenstein",
        "description": "This is a duplicate. Please update your lists. See https://openlibrary.org/works/OL450085W.",
        "contributions": [
          {
            "author": {
              "name": "Mary Shelley"
            }
          },
          {
            "author": {
              "name": "Percy Bysshe Shelley"
            }
          },
          {
            "author": {
              "name": "Maurice Hindle"
            }
          },
          {
            "author": {
              "name": "John William Polidori"
            }
          },
          {
            "author": {
              "name": "Lord Byron"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/18780509/e353c2cafc8293db69a5771436ffc8a8779c26ab.jpeg"
        },
        "rating": 3.853074433656958,
        "ratings_count": 1545,
        "ratings_distribution": [
          {
            "count": 23,
            "rating": 1
          },
          {
            "count": 1,
            "rating": 1.5
          },
          {
            "count": 97,
            "rating": 2
          },
          {
            "count": 8,
            "rating": 2.5
          },
          {
            "count": 371,
            "rating": 3
          },
          {
            "count": 34,
            "rating": 3.5
          },
          {
            "count": 549,
            "rating": 4
          },
          {
            "count": 47,
            "rating": 4.5
          },
          {
            "count": 415,
            "rating": 5
          }
        ],
        "reviews_count": 138,
        "release_year": -800
      },
      {
        "id": 1145808,
        "title": "Gone Girl",
        "description": "On a warm summer morning in North Carthage, Missouri, it is Nick and Amy Dunne’s fifth wedding anniversary. Presents are being wrapped and reservations are being made when Nick’s clever and beautiful wife disappears. Husband-of-the-Year Nick isn’t doing himself any favors with cringe-worthy daydreams about the slope and shape of his wife’s head, but passages from Amy’s diary reveal the alpha-girl perfectionist could have put anyone dangerously on edge. Under mounting pressure from the police and the media—as well as Amy’s fiercely doting parents—the town golden boy parades an endless series of lies, deceits, and inappropriate behavior. Nick is oddly evasive, and he’s definitely bitter—but is he really a killer? \r\n\r\nSource: https://www.penguinrandomhouse.com/books/196906/gone-girl-by-gillian-flynn/",
        "contributions": [
          {
            "author": {
              "name": "Gillian Flynn"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/external_data/59331781/52e626a5ae660e4fc1090b5357c4f15f6a1066de.jpeg"
        },
        "rating": 3.941618911174785,
        "ratings_count": 1396,
        "ratings_distribution": [
          {
            "count": 32,
            "rating": 1
          },
          {
            "count": 84,
            "rating": 2
          },
          {
            "count": 1,
            "rating": 2.5
          },
          {
            "count": 240,
            "rating": 3
          },
          {
            "count": 19,
            "rating": 3.5
          },
          {
            "count": 576,
            "rating": 4
          },
          {
            "count": 21,
            "rating": 4.5
          },
          {
            "count": 423,
            "rating": 5
          }
        ],
        "reviews_count": 196,
        "release_year": 2011
      },
      {
        "id": 1162844,
        "title": "The Perks of Being a Wallflower",
        "description": "Standing on the fringes of life...\noffers a unique perspective. But there comes a time to see\nwhat it looks like from the dance floor.\n\nThis haunting novel about the dilemma of passivity vs. passion marks the stunning debut of a provocative new voice in contemporary fiction: The Perks of Being A WALLFLOWER\n\nThis is the story of what it's like to grow up in high school. More intimate than a diary, Charlie's letters are singular and unique, hilarious and devastating. We may not know where he lives. We may not know to whom he is writing. All we know is the world he shares. Caught between trying to live his life and trying to run from it puts him on a strange course through uncharted territory. The world of first dates and mixed tapes, family dramas and new friends. The world of sex, drugs, and The Rocky Horror Picture Show, when all one requires is that the perfect song on that perfect drive to feel infinite.\n\nThrough Charlie, Stephen Chbosky has created a deeply affecting coming-of-age story, a powerful novel that will spirit you back to those wild and poignant roller coaster days known as growing up.",
        "contributions": [
          {
            "author": {
              "name": "Stephen Chbosky"
            }
          }
        ],
        "image": {
          "url": "https://assets.hardcover.app/edition/6205525/8c3a7c27ba02822d3083c1cca67081c35d702c18.jpeg"
        },
        "rating": 4.062699680511182,
        "ratings_count": 1252,
        "ratings_distribution": [
          {
            "count": 24,
            "rating": 1
          },
          {
            "count": 62,
            "rating": 2
          },
          {
            "count": 2,
            "rating": 2.5
          },
          {
            "count": 206,
            "rating": 3
          },
          {
            "count": 16,
            "rating": 3.5
          },
          {
            "count": 435,
            "rating": 4
          },
          {
            "count": 31,
            "rating": 4.5
          },
          {
            "count": 476,
            "rating": 5
          }
        ],
        "reviews_count": 99,
        "release_year": 1999
      }
    ]
}
